[
    {
      "id": 1,
      "title": "Elon Musk’s X discontinues NFT profile photo feature Elon Musk’s X discontinues NFT profile photo feature",
      "absoluteURL": "https://crypto.news/elon-musks-x-discontinues-nft-profile-photo-feature/",
      "fullContent": "Tech magnate Elon Musk once called adding NFTs to X “annoying” and a waste of engineering resources. Social media platform X has removed features and information related to non-fungible tokens (NFTs) as part of owner Elon Musk’s 2024 vision for the private firm. Due to the change, premium subscribers can no longer upload NFTs as their profile photos. The company’s support page has also been scrubbed of all content about NFT profile photos. X onboarded NFTs for account avatars in January 2022, when the platform was still called Twitter and managed by a board. At the time, Twitter Blue subscribers could use NFTs as their profile photos, which appeared hexagonal. Users could upload digital collectibles minted under the ERC-721 or ERC-1155 token standards, the defacto options for creating NFTs on Ethereum’s blockchain. You might also like: X (Twitter) obtains license to trade crypto in Rhode Island The feature also provided additional information when clicked upon, including the NFT’s contract address and the collection it belonged to. Elon Musk, who would later buy the company for $44 billion in October, criticized the move. Musk said the company was better off addressing its escalating bot issue than adding NFT photos. Notably, bots remain an issuer on X under Musk’s leadership. Twitter is spending engineering resources on this bs while crypto scammers are throwing a spambot block party in every thread!? — Elon Musk (@elonmusk) January 21, 2022 Following the decision to axe NFTs on X, users with hexagonal photos still featured blockchain collectibles. It is unclear if the platform will completely disable these profile photos. However, the announcement has likely cooled off hopes of NFT trading on X timelines, an update previously teased by developers after Musk’s takeover. https://twitter.com/XDevelopers/status/1585707921433923585?s=20&t=MkpjS70e2UltxR3mbHtcsg X is not the only social media company easing out of NFTs. Facebook and Instagram, under their parent company, Meta, announced similar integrations in the same year, although the company shuttered support for NFTs in March 2023. Read more: Elon Musk’s take on NFTs sparks support for Bitcoin Ordinals Follow Us on Google News",
      "tags": [
        "#Elon Musk",
        "#NFT",
        "#Twitter"
      ],
      "publishDate": "12/01/2024"
    },
    {
      "id": 2,
      "title": "Eesee closes $2.85m investment to integrate gamification into marketplace Eesee closes $2.85m investment to integrate gamification into marketplace",
      "absoluteURL": "https://crypto.news/eesee-closes-2-85m-investment-to-integrate-gamification-into-marketplace/",
      "fullContent": "Disclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only. Eesee, a one-stop liquidity solution and gamified marketplace for sellers, has closed its $2.85 million fundraising. The raise included a $1.1 million seed round and a $1.75 million private round, with participation by SevenX Ventures, Maven Capital, MetaBros, Contango Digital Assets, BasementDAO, and more. The company also announced partnerships out of the gate, including Ape Terminal, ApeCoin, Polygon, and Chainlink. Presently, no gamified digital asset marketplaces allow sellers to sell digital assets creatively while eliminating most of the buy-side friction in the industry. The only way to tap into an NFT community is by buying an asset, a massive barrier for new entrants who cannot afford the floor price. You might also like: SEC lawyers to investigate market manipulation amid fake news about Bitcoin ETF With eesee, sellers can create a customized gamified drop, such as a decentralized on-chain raffle, to sell an asset effectively above the current floor price. For buyers, raffles can include action-based entries, where participation in a raffle is determined by completing certain tasks. Similar to airdrop incentives, these campaigns offer the possibility of being rewarded with assets for little to no money. Losers of raffles will also be rewarded with points and airdrop opportunities to ensure mutual incentives across the platform. Vova Sadkov, founder and CEO of eesee, explains: “We see this as a massive opportunity to tap into the next generation of digital asset participants interested in owning and participating in NFTs, tokens, and RWAs. Our gamified approach creates a transparent and legitimate liquidity solution wrapped around various campaigns that align with the ethos of the crypto industry. New entrants, avid collectors, and even speculators can all benefit from the platform.” Murtaza Bohari at Maven Capital said: “eesee is attractive because it taps into two of the industry’s fastest-growing segments, NFTFi and SocialFi. The marketplace’s potential goes beyond a transactional level into a massive community-building opportunity. The use of built-in chats and discussion boards on essee is an example. In theory, the logic behind the platform could eventually apply to any asset, not just digital, that is in demand.” The platform has partnered with Chainlink to use Chainlink VRF to select winners in each campaign officially. Additionally, in October 2023, ApeCoin DAO approved a partnership to drive cross-collaboration between each community. To date, eesee’s testnet has attracted over 262,309 registrants with an average wallet age of one year. Over the last 90 days, the wallets have had 858,000 transactions worth over $174 million, implying an experienced user base. The company’s native token, ESE, is scheduled to be launched in an upcoming TGE in Q1. Read more: Bitcoin dips 3% on false SEC spot Bitcoin ETF approval Disclosure: This content is provided by a third party. crypto.news does not endorse any product mentioned on this page. Users must do their own research before taking any actions related to the company. Follow Us on Google News",
      "tags": [
        "#fundraising",
        "#Gamers",
        "#NFT",
        "#Web3"
      ],
      "publishDate": "12/01/2024"
    },
    {
      "id": 3,
      "title": "X account of p2e game DeFi Kingdoms compromised X account of p2e game DeFi Kingdoms compromised",
      "absoluteURL": "https://crypto.news/x-account-of-p2e-game-defi-kingdoms-compromised/",
      "fullContent": "The DeFi Kingdoms X page has apparently been hacked promoting what appears to be a phishing website. In an X post on Jan. 9, an account for DFK Chain, an Avalanche Subnet crafted for DeFi Kingdoms, said that the play-to-earn game’s X account fell victim to a hacker attack, leading to the publishing of phishing links. DFK TWITTER @DeFiKingdoms IS COMPROMISED. PLEASE DO NOT FOLLOW ANY LINKS FROM THE DFK TWITTER. We are working on a resolution. — DFK Chain (@dfkchain) January 8, 2024 While the exact method of compromising the account remains unclear, @DreamerDFK, the president of Kingdom Studios, disclosed in a separate post that the security breach was related to an X security issue, distinct from DFK Chain and its Discord. You might also like: Code4arena X account compromised, used for Paradigm endorsed phishing scam It’s just Twitter, no source code, discord, or other channels have been compromised, this is an X security issue, not #DFK related. — Dreamer 🔺 (@DreamerDFK) January 8, 2024 In a fraudulent post on DeFi Kingdoms’ X account, scammers attempt to lure victims into clicking on a link that closely mimics the official domain of the game. The full scope of the attack remains uncertain, as DeFi Kingdoms has not yet regained access to its X account. Launched in 2021, DeFi Kingdoms is a video game built on the DFK Chain featuring pixel art style with tokenized resources, and support for in-game non-fungible tokens (NFTs) integrated with defi protocols. The game utilizes the JEWEL token for gas fees on the DFK Chain. Read more: Crypto security firm CertiK’s X account compromised Follow Us on Google News",
      "tags": [
        "#Avalanche",
        "#hack",
        "#NFT",
        "#Play to Earn"
      ],
      "publishDate": "12/01/2024"
    },
    {
      "id": 4,
      "title": "Scammers impersonate crypto journalists with malicious Calendly links on X Scammers impersonate crypto journalists with malicious Calendly links on X",
      "absoluteURL": "https://crypto.news/scammers-impersonate-crypto-journalists-with-malicious-calendly-links-on-x/",
      "fullContent": "Security experts issue warnings as malicious actors distribute fake Calendly bot clones on X, posing as crypto journalists. According to an X post from blockchain security firm SlowMist, con artists are targeting Chinese-speaking victims by pretending to be crypto journalists. The scammers send direct messages, including links that mimic the appearance of a legit Calendly bot, for scheduling interviews. https://twitter.com/SlowMist_Team/status/1744186256630886488?s=20 However, once a victim grants authorization to the fake clone of the bot, they unwittingly give control of their X account, providing scammers with the ability to distribute phishing links through their posts. Although the scale of the scam attack remains unclear, SlowMist notes that the scammers often communicate in broken Chinese and focus their efforts on crypto influencers. According to user @0xcryptowizard on X, the cyber criminals are linked to the crypto hacking group known as Pink Drainer. You might also like: X users at risk as crypto scammers exploit new design flaw If you think your X account is at risk, delete any suspicious applications or sessions asap in👇 \"Settings->Security and account access->Apps and sessions\". pic.twitter.com/N8xK2vUPe4 — SlowMist (@SlowMist_Team) January 8, 2024 SlowMist has urged users to delete any suspicious applications or sessions in their X settings to mitigate the risk of unauthorized access. This is not the first time scammers are impersonating journalists in a bid to exploit victims and pilfer private data and cryptocurrencies. In November 2023, crypto.news reported about SlowMist’s revelation of a sophisticated phishing attack on the crypto startup Friend.tech, where fraudsters utilized fake interviews and malicious scripts to target users. During the same month, an unidentified con artist, posing as a Forbes journalist, approached holders of Bored Ape Yacht Club non-fungible tokens (NFTs), requesting their experiences with the popular NFT collection. In interviews, the scammers set up multiple call links and recorded screens using a separate recorder bot, as reported by one victim. Read more: Scammers drained nearly $300m in 2023, data shows Follow Us on Google News",
      "tags": [
        "#crypto scam",
        "#NFT",
        "#Slowmist",
        "#Twitter"
      ],
      "publishDate": "08/01/2024"
    },
    {
      "id": 5,
      "title": "Logan Paul faces backlash after declaring $2.3m refund for CryptoZoo NFTs Logan Paul faces backlash after declaring $2.3m refund for CryptoZoo NFTs",
      "absoluteURL": "https://crypto.news/logan-paul-faces-backlash-after-declaring-2-3m-refund-for-cryptozoo-nfts/",
      "fullContent": "Tom Kherkher, a YouTuber and owner of the Attorney Tom and Associates law firm, says Logan Paul’s announcement to buy back CryptoZoo NFTs is filled with a ‘bunch of inaccuracies.’ In an X post on Jan. 4, Logan Paul announced a plan to “personally” commit more than $2.3 million to buy back non-fungible tokens (NFTs) purchased through CryptoZoo, a play-to-earn crypto game centered around NFTs, which did not live up to the expectations set during its promotion and faced mixed response after the release. Today, I am incredibly happy to announce that I am delivering on my promise to buy back Base Egg and Base Animal CryptoZoo NFTs for their original purchase price. This buy-back program is being carried out at https://t.co/XIQzLAGKiG. Claims can be submitted through this site… pic.twitter.com/VMPDHvdXkq — Logan Paul (@LoganPaul) January 4, 2024 In the latest refund announcement, Paul said claims for the buy-back can be submitted via a special website until Feb. 8. However, it is unlikely that early supporters will be made whole, as the website states that claimants will get as much as 0.1 ETH per eligible NFT from which an eligible NFT was submitted. You might also like: CryptoZoo scam rumors bite Logan Paul In addition to that, Paul emphasized that the buyback is “not intended to compensate those who gambled on the crypto market and lost,” implying that buyers of the ZOO tokens — an in-game currency that could be used to buy NFTs — are unlikely to be compensated at all. Moreover, claimants would also have to agree to waive any “actual or anticipated claims against Paul,” which means promising not to take legal action against him regarding CryptoZoo. They would say this is a predatory tactic to include a total claim waiver on a \"buyback\" that only accounts for a small fraction of the financial damage he caused. https://t.co/22Ub8hAxA5 pic.twitter.com/zitZgHNJQE — AttorneyTom (@attorney_tom) January 5, 2024 Tom Kherkher, a YouTuber and owner of the Attorney Tom and Associates law firm, criticized Paul’s latest refund initiative, saying in an X post that the influencer’s buyback is a “sneaky trick.” “It’s [Paul’s statement] is filled with a bunch of inaccuracies, misstatements, and quite frankly just a PR spin.” Tom Kherkher So @LoganPaul announced today that he’s refunding Cryptozoo. So I click the link and see this guy blocked me??? I was the #1 zoo holder and never said shit about this guy but today’s the day… Cryptozoo: #1- $ZOO was rugged by Guru for 7 figures. #2- the team stole money too… pic.twitter.com/PPqF6ys937 — doitbigchicago (@doitbigchicago) January 4, 2024 Alan Wehbi (also known as @doitbigchicago on Twitter) who claims to be the largest ZOO holder appears to be dissatisfied with Paul’s buyback after finding out he was blocked by the influencer on the social network. “I sent the text but if I’m not made whole in 7 days for $ZOO and Egg losses I’m adding you to the list of legal action for 2024.” @doitbigchicago However, Wehbi did not specify how much he had invested in the ZOO tokens. This is not the first time Paul has promised to compensate those who lost money in the crypto game, which, according to the influencer, was “derailed by bad actors.” In early 2023, the influencer unveiled a $1.3 million recovery plan “for disappointed players” who contributed to CryptoZoo. It’s unclear if Paul made any compensations at all since his first announcement last year. Read more: Logan Paul drops lawsuit threats on Coffeezilla and apologizes Follow Us on Google News",
      "tags": [
        "#crypto scam",
        "#CryptoZoo",
        "#Logan Paul",
        "#NFT"
      ],
      "publishDate": "12/01/2024"
    },
    {
      "id": 6,
      "title": "Developer asks community not to underestimate Bitcoin Ordinals Developer asks community not to underestimate Bitcoin Ordinals",
      "absoluteURL": "https://crypto.news/developer-asks-community-not-to-underestimate-bitcoin-ordinals/",
      "fullContent": "Famous Bitcoin (BTC) developer Udi Wertheimer advocated for the adoption of Bitcoin Ordinals, despite widespread industry criticism. In a post on X, Wertheimer noted that many people reject the concept of Bitcoin Ordinals. However, he supported the adoption of Bitcoin Ordinals and opposed those who have sought to eliminate them. HOW TO KILL ORDINALS I’ve been contacted by multiple laser-eye maxis, and some bitcoin developers, who tried to understand “what’s going on” and “how can we stop this”. Here’s my advice. 1. Start using it. The number 1 issue you guys are facing, is that you have no idea… pic.twitter.com/hCaICjSPHa — Udi Wertheimer (@udiWertheimer) January 1, 2024 Wertheimer states that “many high-ranking teams have powerful developers.” Instead, he encourages his 183,400 followers to experiment with the technology. However, Wertheimer emphasizes the importance of Ordinals in the Bitcoin blockchain but states that he considers Bitcoin’s role as a store of value to be more critical and paramount. Additionally, Wertheimer does not believe that Bitcoin Ordinals are a problem due to the lack of demand for Bitcoin payments. “That’s the main reason why I believe ordinals are not a problem in the first place. It’s not like there are that many people who wanted to use BTC payments otherwise.” Udi Wertheimer, In December, Bitcoin Core developer Luke Dashjr reported a vulnerability in the Bitcoin blockchain and admitted that after fixing the vulnerability, Ordinals and the BRC-20 standard would cease to exist. According to him, creating digital artifacts is possible only because Bitcoin Core does not restrict the size of additional data that can be included in transactions. He also insists that Ordinals harm Bitcoin and its users, and their impact is enormous and irreversible. Read more: Ordinals boom sent Bitcoin fees to record Follow Us on Google News",
      "tags": [
        "#Bitcoin",
        "#NFT",
        "#Ordinals"
      ],
      "publishDate": "11/01/2024"
    },
    {
      "id": 7,
      "title": "NFT sales on Bitcoin hit record in December 2023 NFT sales on Bitcoin hit record in December 2023",
      "absoluteURL": "https://crypto.news/nft-sales-on-bitcoin-hit-record-in-december-2023/",
      "fullContent": "Sales of non-fungible tokens (NFTs) on the Bitcoin (BTC) network reached $881 million in December 2023. According to the Cryptoslam portal, in December 2023, NFT sales set the highest single-month sales record. Source: Cryptoslam In addition, a record 111,713 buyer addresses participated in NFT transactions on the Bitcoin chain in December. Simultaneously, the number of merchant addresses rose to 98,744, marking the highest number of merchants in a month. Meanwhile according to Cryptoslam, the total sales of NFT Ethereum (ETH) amounted to $364.79 million. Sales of BTC-focused NFTs outpaced ETH sales in December by 2.34 times. You might also like: Were NFTs a fad, and is it worth investing in them now? The most valuable NFT transaction in December was a digital copy of Vincent Van Gogh’s 1888 self-portrait (Van Gogh painting #216), which sold for $1.19 million. The Ethereum platform held a sale of the Frxethredemption Ticket #33 token, priced at $638,433 in December. In December, Bitcoin Core developer Luke Dashjr said that Inscriptions, which are the basis of the Ordinals protocol, contribute to the spread of spam on the network and predicted their imminent end. The developer’s statements caused criticism and questions from the community about the appropriateness of such methods of censoring the blockchain. One user noted that most miners would prefer to mine transactions with “inscriptions” as they make “more economic sense.” Read more: Ordinals boom sent Bitcoin fees to record Follow Us on Google News",
      "tags": [
        "#Bitcoin",
        "#Ethereum",
        "#NFT"
      ],
      "publishDate": "11/01/2024"
    },
    {
      "id": 8,
      "title": "Trump-related crypto wallet cashed out $2.4m worth of ETH Trump-related crypto wallet cashed out $2.4m worth of ETH",
      "absoluteURL": "https://crypto.news/trump-related-crypto-wallet-cashed-out-2-4m-worth-of-eth/",
      "fullContent": "According to on-chain data, a crypto wallet associated with the former U.S. president has transferred millions of dollars worth of Ethereum to Coinbase. An Ethereum wallet, which has been accumulating royalties from Donald Trump‘s NFT collection for months, has started moving the funds to the centralized crypto exchange. According to Arkham Intelligence, the wallet has transferred 1,075 ETH (around $2.4 million at the time of the transaction) to Coinbase. Looks like Donald Trump is selling his ETH. 3 weeks ago he started sending ETH to Coinbase after months of accumulating Trump NFT royalties. His peak balance was $4 million. Based on the deposits, so far he's sold 1,075 ETH for $2.4 million. pic.twitter.com/JZzA3cS2je — Arkham (@ArkhamIntel) December 27, 2023 While the purpose behind transferring the funds to Coinbase remains unclear, data suggests that the Trump-associated wallet still holds multiple cryptocurrencies valued at over $2.2 million. You might also like: Donald Trump is accused of using copyrighted images for his NFTs According to the wallet’s data, the majority of the funds are allocated in ETH (approximately $1.4 million), followed by WETH (almost $650,000) and the TRUMP token (around $177,000). The wallet, at its peak, held approximately $4 million worth of a diverse range of cryptocurrencies, as indicated by the data. Trump-related crypto wallet | Source: Arkham Intelligence This transfer coincides with the unveiling of a new NFT collection titled the “Mugshot Edition,” a nod to the recent legal challenges faced by the Republican politician. As reported by crypto.news, in mid-December, Trump took to his social network Truth Social to announce the release of new non-fungible tokens featuring an infamous mug shot captured after the former President’s booking in an Atlanta-area jail last August on charges related to the alleged conspiracy to overturn Georgia’s election results. Read more: Melania Trump releases NFT collection for foster children Follow Us on Google News",
      "tags": [
        "#Coinbase",
        "#Donald Trump",
        "#NFT"
      ],
      "publishDate": "11/01/2024"
    },
    {
      "id": 9,
      "title": "Yuga Labs unveils CryptoPunks721 wrapper to simplify NFT trading Yuga Labs unveils CryptoPunks721 wrapper to simplify NFT trading",
      "absoluteURL": "https://crypto.news/yuga-labs-unveils-cryptopunks721-wrapper-to-simplify-nft-trading/",
      "fullContent": "Bored Ape developer Yuga Labs has rolled out a new wrapper for the CryptoPunks collection to ease trades on marketplaces. According to an X thread by Yuga Labs‘ smart contract developer, @0xQuit, the newly introduced CryptoPunks721 wrapper operates on a permissionless basis and utilizes Larva Labs‘ PunksData smart contract for on-chain metadata. The primary objective behind developing the new wrapper is to streamline the trading of NFTs from the CryptoPunks collection, originally minted in 2017, predating the widespread acceptance of the ERC-721 standard in January 2018. Last week, Yuga finalized a series of interconnected contracts that unlock new possibilities across our projects. They'll start simple, but they're designed to allow evolution over time. Introducing: Your Stash. 1/🧵 pic.twitter.com/lI5L0eapZQ — quit (👀,🦄) (@0xQuit) December 20, 2023 As noted by @0xQuit, the original NFTs from the CryptoPunks collection necessitate wrapping before being eligible for sale on key marketplaces. Wrapping involves creating a cloned token with equivalent value, while a custodian securely holds the original token. This process involves multiple transactions, resulting in high operational costs. You might also like: CryptoPunks drive NFT surge with $1.1m sale The introduction of the CryptoPunks721 wrapper aims to address these limitations by enabling both wrapping and unwrapping of C721 tokens in a single transaction, consequently reducing gas fees. Launched in 2017 by Matt Hall and John Watkinson of Larva Labs, CryptoPunks is a collection of 10,000 algorithmically generated pixel art characters in the form of NFTs on the Ethereum blockchain. Each CryptoPunk is distinct and has its own set of features, contributing to its rarity. In March 2022, Yuga Labs, the company behind the Bored Ape Yacht Club (BAYC) NFT collection, acquired the NFT series of CryptoPunks and Meebits. The financial terms of the deal were not disclosed. Read more: What’s the story behind Bored Ape Yacht Club creator Yuga Labs Follow Us on Google News",
      "tags": [
        "#CryptoPunks",
        "#Larva Labs",
        "#NFT",
        "#Yuga Labs"
      ],
      "publishDate": "11/01/2024"
    },
    {
      "id": 10,
      "title": "Epic Games Store welcomes blockchain games despite ‘adults only’ ratings Epic Games Store welcomes blockchain games despite ‘adults only’ ratings",
      "absoluteURL": "https://crypto.news/epic-games-store-welcomes-blockchain-games-despite-adults-only-ratings/",
      "fullContent": "Epic Games, known for Fortnite, breaks its ban on ‘adults only’ games, allowing blockchain titles with AO ratings by the ESRB. The Epic Games Store, a digital distribution platform operated by Epic Games, the creator of popular video games like Fortnite and Unreal Tournament, has decided to welcome back blockchain-powered video games that were previously classified as “Adults Only” (AO) by the Entertainment Software Rating Board (ESRB), according to the firm’s latest updates. The move marks a departure from the platform’s strict prohibition on AO-rated games, typically associated with excessive nudity or violence. You might also like: CoinGecko: 75% of web3 games over last five years have failed The marketplace’s content guidelines page now says that the Epic Games Store makes an “exception for products in cases where an AO rating was applied solely due to the usage of blockchain or NFT technology.” In a commentary to The Verge, a spokesperson for Epic Games confirmed the move, saying that some blockchain-based video games received AO ratings only due to their particular implementation of blockchain. 📣 Heads up: Gods Unchained and Striker Manager 3 have returned to the Store after a change in our content policy regarding ratings for blockchain-based games. Learn more: https://t.co/RQGGzWGeG8 — Epic Games Store (@EpicGames) December 19, 2023 With the latest update, the Epic Games Store returned some of the games like Gods Unchained and Striker Manager 3, which were previously removed due to their ratings. The ESRB’s AO rating is recognized as the strictest, prompting some stores to abstain from selling these games entirely. In contrast to platforms like Steam and Itch.io, which allow AO games with the option for users to filter them, Steam does not embrace blockchain games. According to blockchain developers, Steam’s point of view is that “items have value and they [Steam developers] don’t allow items that can have real-world value on their platform.” Read more: How to make money playing crypto games Follow Us on Google News",
      "tags": [
        "#Blockchain",
        "#Epic Games",
        "#Gods Unchained",
        "#NFT",
        "#Steam"
      ],
      "publishDate": "11/01/2024"
    },
    {
      "id": 11,
      "title": "FIFA’s NFTs find instant trading frenzy FIFA’s NFTs find instant trading frenzy",
      "absoluteURL": "https://crypto.news/fifas-nfts-find-instant-trading-frenzy/",
      "fullContent": "The inaugural NFT drop from FIFA+ Collect Club sold out just three hours after release, according to an announcement shared with crypto.news. The FIFA+ Collect Club, a collaboration between FIFA and technology firm Modex, made digital collectible “membership cards” available on Dec. 12 priced at $999 each. According to Modex, the full allotment of membership cards was purchased within three hours. In a press release, Modex indicated that as part of the membership program, holders of the sold-out VIP cards will receive what was described as an airdrop on Dec. 26 containing highlights from the FIFA Club World Cup 2023 hosted in Saudi Arabia next year. The statement claims two highlights will come with tickets to the FIFA World Cup 2026 final and FIFA Club World Cup 2025 final, both to be held in the United States. You might also like: NFT sales decline, Solana surpasses Ethereum’s volume Building on the rapid sellout, Modex has revealed plans to launch a second set of non-fungible tokens (NFTs) on the OpenSea marketplace and Polygon (MATIC) network on Dec. 19. A total of 900 non-fungible tokens will be released, representing VIP experiences and physical items from the 2023 FIFA Club World Cup according to the press release. Details of exact items or “benefits” associated with each NFT will only be available during purchase. Among the offerings mentioned are tickets to prestigious FIFA ceremonies and events, autographed memorabilia from the tournament, and limited-edition collectibles like player-signed corner flags and referee kits. The FIFA initiative closely resembles the National Basketball Association’s NBA Top Shot NFT series, which were found to possibly be securities back in February. Read more: Flooring Protocol allegedly hacked for NFTs worth $1.5m Follow Us on Google News",
      "tags": [
        "#FIFA",
        "#NFT",
        "#Sports"
      ],
      "publishDate": "19/12/2023"
    },
    {
      "id": 12,
      "title": "Hong Kong mobile network provider launches NFT marketplace Hong Kong mobile network provider launches NFT marketplace",
      "absoluteURL": "https://crypto.news/hong-kong-mobile-network-provider-launches-nft-marketplace/",
      "fullContent": "China Mobile Hong Kong, a leading mobile communication brand in Hong Kong, is launching its own NFT marketplace, LinkNFT. It will be Hong Kong’s first telecom-operated NFT marketplace. This launch coincides with the breakthrough of their comprehensive smart living mobile application, MyLink, which has acquired over seven million users. LinkNFT will offer NFT minting services for businesses, facilitating digital asset creation, trade, and circulation through various scenarios such as SocialFi, DeFi, and GameFi. It will use a trio of cross-chain standards – web3 Center cross-chain service protocol, cross-chain adapter, and cross-chain smart contract – for seamless web3 interoperability. Hong Kong residents can easily access their digital assets, including Ethereum-based ones like Opensea, through MyLink’s exclusive digital wallet “LinKey.” You might also like: SEC is taking ‘new look’ at spot Bitcoin ETF applications China Mobile Hong Kong (CMHK) has collaborated with various sectors to release over 30 NFTs on LinkNFT, including 20 commemorative editions from the MyLink ArLink series and 15 NFTs associated with publishers and music platforms like Migu Music. The total number of NFT issuance is expected to exceed 500,000. MyLink’s Metaverse digital space has also been upgraded to a comprehensive 3D immersive experience, allowing Hong Kong citizens to create their digital homes and explore a virtual Hong Kong city with various facilities like shopping malls and exhibition halls. This upgrade enables citizens to convert their Meta IDs into NFTs, fostering a unique digital community within the web3 ecosystem. Mr. Tan Hui, Executive Director of MyLink, says the new venture will allow enterprises to offer novel consumer rights through various NFTs while users enjoy collectible and circulation value. Read more: Hong Kong mulls green bond sale using blockchain Follow Us on Google News",
      "tags": [
        "#China",
        "#Hong Kong",
        "#NFT"
      ],
      "publishDate": "15/12/2023"
    },
    {
      "id": 13,
      "title": "Trump releases new mug shot NFT as former President’s ongoing legal issues mount Trump releases new mug shot NFT as former President’s ongoing legal issues mount",
      "absoluteURL": "https://crypto.news/trump-releases-new-mug-shot-nft-as-former-presidents-ongoing-legal-issues-mount/",
      "fullContent": "Former President of the Donald Trump has unveiled a new NFT collection called the ‘Mugshot Edition,’ a play on the recent legal woes mounting against the leading Republican candidate. A new NFT collection by former President Donald Trump is taking the internet by storm. On Dec. 12, 2023, Trump took to Truth Social to announce the drop of new NFT featuring an infamous mug shot taken of the former President after he was booked in an Atlanta-area jail last August on charges of conspiring to overthrow Georgia’s election results. With reactions to the NFT going viral on X, crypto.news has compiled some of the best reactions to the former President’s latest foray into NFTs, which features 2,024 unique pieces of the suit he wore to get his mugshot taken in Georgia, available to buyers who purchase 47 NFTs priced at $99 each. “It was a great suit, believe me, a really good suit. It’s all cut up, and you’re gonna get a piece of it,” Trump said in a video on Truth Social. You might also like: Donald Trump is accused of using copyrighted images for his NFTs Many in cryptocurrency community greeted the news of the release with a mix of enthusiasm and skepticism. trump launching a THIRD nft collection pic.twitter.com/wCRPTyXcGl — 0xngmi (@0xngmi) December 12, 2023 Others said they were aping in. dropped 10 bands on the Trump NFT's see y'all at Mar-a-lago 😎🫡 pic.twitter.com/Q1LV7arZXx — gorl (@Starcaster1) December 13, 2023 It is not the first NFT collection from the former U.S. President has dropped. In August, blockchain intelligence platform Arkham Intelligence discovered a crypto wallet linked to Trump, noting that the wallet then had a balance of $2,821,575, by current market valuations, the wallet appears to be in the green more than five fold. In August 2023, Trump reported investing between $250,000 and $500,000 in various cryptocurrencies. You might also like: Melania Trump releases NFT collection for foster children Follow Us on Google News",
      "tags": [
        "#Donald Trump",
        "#NFT"
      ],
      "publishDate": "13/12/2023"
    },
    {
      "id": 14,
      "title": "Ethereum gets the boot as Enjin migrates 200m NFTs to its own blockchain Ethereum gets the boot as Enjin migrates 200m NFTs to its own blockchain",
      "absoluteURL": "https://crypto.news/ethereum-gets-the-boot-as-enjin-migrates-200m-nfts-to-its-own-blockchain/",
      "fullContent": "Blockchain developer Enjin has transferred 200 million non-fungible tokens (NFTs) to its own blockchain in an effort to boost up the usage of its network. In a blog post on Dec. 11, 2023, the Singapore-based company said NFT holders can now claim their assets on the Enjin Blockchain using the updated version of the Enjin crypto wallet. As part of the migration campaign, users are also free of any transactional costs across the ecosystem for the next three months, the announcement says. You might also like: OpenSea on back-footing as OKX surpasses it in NFT trading volume Oscar Franklin Tan, Atlas chief financial officer, said this was one of the “most complex, unprecedented blockchain migrations,” as it involved migration of both fungible and non-fungible tokens from Ethereum, Polkadot and Enjin Blockchain. “Enjin’s NFT migration follows and completes its token migration. Strong support from migrating holders secures the new Enjin Blockchain and expands governance.” Oscar Franklin Tan The Enjin team emphasized the migration included assets from thousands of digital creators, including tech giant Microsoft. According to a previous report, Enjin transferred 118 million NFTs hosted on Ethereum, as well as over 100 million NFTs on JumpNet, a sidechain for Ethereum have been transferred to its mainnet called the Enjin Blockchain. Enjin Blockchain is a public, decentralized blockchain, which was developed by the Enjin team for creators looking for a cheaper way to host their NFTs on a distributed ledger. The network also has its own native token called Enjin Coin (ENJ), which is currently trading at $0.33, according to CoinGecko data. Read more: Enjin token soars amid new NFT marketplace expectations Follow Us on Google News",
      "tags": [
        "#Blockchain",
        "#Enjin",
        "#NFT"
      ],
      "publishDate": "12/12/2023"
    },
    {
      "id": 15,
      "title": "OpenSea on back-footing as OKX surpasses it in NFT trading volume OpenSea on back-footing as OKX surpasses it in NFT trading volume",
      "absoluteURL": "https://crypto.news/opensea-on-back-footing-as-okx-surpasses-it-in-nft-trading-volume/",
      "fullContent": "According to data from DappRadar, OKX NFT marketplace secured 32% dominance in the NFT sector, surpassing OpenSea in trading volume. In a blog post on Dec. 7, 202, DappRadar gathered top marketplaces for trading digital collectibles, which allocated the most liquidity in November 2023. According to the data, the Blur marketplace was ranked the top platform, controlling a 35% share of the NFT trading volume and generating $345 million in trades in November 2023. Top NFT trading platforms by volume | Source: DappRadar OKX NFT, a digital marketplace powered by the OKX crypto exchange, appeared to be the second-largest NFT platform over the past month, surpassing OpenSea in trading volume. As per DappRadar, OKX NFT secured a “substantial 32% dominance in the NFT sector,” overtaking OpenSea, which is currently holding a 10% market share in terms of trading volume. Yet, DappRadar Blockchain Analyst Sara Gherghelas notes that OpenSea remains the top platform in terms of user base with over 190,000 registered accounts as of November 2023. She also suggested OKX succeeded in its efforts thanks to its bet on unique offerings of Bitcoin Ordinals art pieces. You might also like: Binance lists ORDI, confuses it with Bitcoin Ordinals project However, it is yet to be seen if OKX could retain its title given that Bitcoin Core developers are planning to get rid of Inscriptions, essentially putting an end to Bitcoin Ordinals and BRC-20 tokens. As crypto.news reported, Bitcoin Core developer Luke Dashjr hopes to put an end to BRC-20 tokens and Bitcoin-based NFTs with a set of upgrades as these products appear to be spamming the network, leading to an excessive amount of data being stored on the blockchain. Bitcoin Ordinals are non-fungible tokens that enable the inscribing of data onto a satoshi, the smallest division of a Bitcoin. Since its launch in January 2023, the protocol has seen the inscription trend take off, leading to thousands being minted on the Bitcoin network. This has caused congestion and spikes in transaction fees, reaching a peak in April and May 2023. Read more: VC giant Tiger Global reportedly cut stakes in OpenSea and NFT collection BAYC Follow Us on Google News",
      "tags": [
        "#Bitcoin",
        "#Blur",
        "#NFT",
        "#OKX",
        "#OpenSea",
        "#Ordinals"
      ],
      "publishDate": "08/12/2023"
    },
    {
      "id": 16,
      "title": "Reebok taps Futureverse to expand web3 experience with AI Reebok taps Futureverse to expand web3 experience with AI",
      "absoluteURL": "https://crypto.news/reebok-taps-futureverse-to-expand-web3-experience-with-ai/",
      "fullContent": "American fitness brand Reebok has entered into a collaboration with web3 startup Futureverse. As per an X thread published by Futureverse on Dec. 7, 2023, Reebok is set to dive deep into the web3 with its new initiative dubbed “Reebok Impact.” While the details of the collaboration were not disclosed, Futureverse says the Reebok-focused venture will debut in 2024, featuring a “heart-bending digital shoe experience that will allow mass consumers to dive into artificial intelligence and digital wearables.” Thrilled to announce our exclusive partnership with @Reebok to leverage our AI and metaverse technology to revolutionize digital fashion. Together, we introduce @ReebokImpact. Coming 2024. pic.twitter.com/30Qk02aujk — Futureverse (@futureverse) December 7, 2023 You might also like: Adidas announces collaboration with NFT artist Fewocious In a commentary to WWD, Daniel W. Dienst, Executive Vice Chairman of Tactical Opportunities at Authentic Brands Group, Reebok’s parent company, said that with the new product, the both companies want to “redefine the intersection of fashion, technology and culture,” adding it will be a “pivotal moment in Reebok’s brand evolution.” Reebok CEO Todd Krinsky added that the partnership with Futureverse enables the firm to “transcend traditional boundaries of innovation to engage our consumers in the digital evolution of our products in ways that redefine the realm of possibility.” Although the announcement is marked as the first step in Reebok and Futureverse’s long-term partnership, it’s not the first efforts made by the Boston-headquartered fitness brand into the web3 space. In December 2021, Reebok collaborated with American rapper A$AP NAST to mint limited-edition non-fungible tokens (NFTs) on the RFOX marketplace. Read more: Reebok joins the Metaverse bandwagon after Nike and Adidas Follow Us on Google News",
      "tags": [
        "#NFT",
        "#Reebok",
        "#Web3"
      ],
      "publishDate": "08/12/2023"
    },
    {
      "id": 17,
      "title": "Heavy metal band Megadeth launches generative NFT collection Heavy metal band Megadeth launches generative NFT collection",
      "absoluteURL": "https://crypto.news/heavy-metal-band-megadeth-launches-generative-nft-collection/",
      "fullContent": "Heavy metal band Megadeth took to X on Dec. 5 to announce the introduction of its 5,000-piece generative collection featuring the band’s mascot, Vic Rattlehead. This initiative transforms beyond a traditional fan club, emerging as a community owned by the fans. Introducing @MegadethDigital. Our 5000-piece generative collection featuring Vic Rattlehead brought to life in a new way by our talented artist @TheHaddy. Live on December 22nd, you'll have the opportunity to unlock doors in the real and metaverse world alike, gaining access to… pic.twitter.com/Ed9YxqCTe6 — Megadeth (@Megadeth) December 5, 2023 As part of the announcement, the band shares that the collection, MegadethDigital, brought to life by artist TheHaddy, is set to go live on Dec. 22. The collection will offer participants access to exclusive merchandise and VIP experiences, including opportunities to acquire signed items and engage in one-on-one conversations with the band members. You might also like: Megadeth Debuts on Web3 With Its “Rattleheads” NFT Collection The band is hardly the first to the NFT game where metal bands are concerned. Avenged Sevenfold was also reported to share support for the digital asset class in May of this year. A resurgence of NFTs The timing of the release may also be suitable for another reason, coinciding with a recent research report by Binance that highlighted the NFT market witnessed a notable upswing in November, signaling a reversal from its year-long decline, achieving a sales volume of $0.91 billion. This surge indicates a remarkable 200% month-over-month increase, marking the highest growth in 2023. Read more: Binance Research: NFTs witnessed turnaround in November, reversing year long downward trend Follow Us on Google News",
      "tags": [
        "#Binance",
        "#Megadeth",
        "#NFT"
      ],
      "publishDate": "06/12/2023"
    },
    {
      "id": 18,
      "title": "Binance Research: NFTs witnessed turnaround in November, reversing year long downward trend Binance Research: NFTs witnessed turnaround in November, reversing year long downward trend",
      "absoluteURL": "https://crypto.news/binance-research-nfts-witnessed-turnaround-in-november-reversing-year-long-downward-trend/",
      "fullContent": "A new research report from Binance highlights that the NFT market experienced an upswing in November, marking a turnaround from its year-long downturn with a sales volume of $0.91 billion. These numbers highlight a 200% month-over-month increase, the most substantial growth seen in 2023 so far. Bitcoin NFTs dominate The research report shared with crypto.news on Dec. 4 points to indicators of this recovery, including Nansen’s NFT-500 Index and the Blue Chip 10 Index, showing reduced year-to-date declines at 49% and 43%, respectively, showcasing improvement from the previous month’s 58% and 50%. Binance also attributes the resurgence in NFT sales to the prominence of Bitcoin NFTs. The $SATS collection, featuring individual satoshis with unique identifiers, is among the standouts with 1,039% month-over-month growth in sales volume, surging to $93 million. You might also like: Vitalik Buterin NFT collection triggers surge in Ethereum gas fees This figure is said to outshine the sales volumes of other prominent NFT collections, including Bored Ape Yacht Club at $42 million and CryptoPunks at $29 million. A larger upward trajectory The report, which looks at several industry trends, also states that November witnessed a sustained upward trajectory in the crypto market, marked by an 11% month-on-month surge in total market capitalization. Additionally, the defi sector continued its expansion, maintaining the positive trend observed in October, and recorded a noteworthy 10% month-on-month increase in Total Value Locked (TVL) during November. In contrast to the beginning of the year, these numbers show that investor sentiment is likely to take a turn for the better. Read more: NFTs will remain a permanent fixture in society | Opinion Follow Us on Google News",
      "tags": [
        "#Binance Research",
        "#DeFi",
        "#NFT"
      ],
      "publishDate": "04/12/2023"
    },
    {
      "id": 19,
      "title": "VC giant Tiger Global reportedly cut stakes in OpenSea and NFT collection BAYC VC giant Tiger Global reportedly cut stakes in OpenSea and NFT collection BAYC",
      "absoluteURL": "https://crypto.news/vc-giant-tiger-global-reportedly-cut-stakes-in-opensea-and-nft-collection-bayc/",
      "fullContent": "Investment firm Tiger Global is said to have marked down the value of its stakes in Bored Ape Yacht Club and OpenSea. According to a report from Bloomberg, the New York-headquartered investment firm has slashed its stakes in Bored Ape Yacht Club (BAYC) and marketplace for digital collectibles OpenSea by 69% and 94% respectively. While the reason for the move was not clear, it was not the only reduction made by Tiger Global. As per the report, the VC firm also slashed its stake in an AI-powered email company Superhuman by 45% and cut its valuation for search engine website DuckDuckGo by 72%, according to people familiar with the matter. You might also like: Magic Eden releases cross-chain NFT and crypto wallet Bloomberg claims investors in Tiger Global’s Private Investment Partners 15 fund suffered an 18% paper loss at the end of September, suggesting the latest move was made in a bid to contain risks of further decline. As of press time, Tiger Global made no public statements on the matter. This is the second firm that has slashed its stakes in OpenSea this quarter as the whole market of non-fungible tokens remains tepid. In early November 2023, crypto.news reported that Coatue Management, a U.S.-based tech investment firm, also reduced the valuation of its investment in the NFT marketplace by 90%. According to multiple reports, Coatue slashed its stake from an initial $120 million to a mere $13 million. The BAYC collection is also facing hurdles as the current price floor of a digital monkey is staying at 28.6 ETH, a 77% decline from its all-time high in May 2022, according to data from NFT Price Floor. Read more: OpenSea users targeted in phishing scam disguised as official NFT offers Follow Us on Google News",
      "tags": [
        "#Bored Ape Yacht Club",
        "#NFT",
        "#OpenSea"
      ],
      "publishDate": "01/12/2023"
    },
    {
      "id": 20,
      "title": "Magic Eden releases cross-chain NFT and crypto wallet Magic Eden releases cross-chain NFT and crypto wallet",
      "absoluteURL": "https://crypto.news/magic-eden-releases-cross-chain-nft-and-crypto-wallet/",
      "fullContent": "Magic Eden has announced the launch of a multi-chain compatible crypto wallet browser extension, aiming to simplify user interaction across different blockchains. Magic Eden, a leading player in the NFT marketplace, is taking a significant step towards a more integrated and user-friendly crypto experience with its upcoming crypto wallet browser extension. This development, as announced by CEO and co-founder Jack Lu, is designed to support a multi-chain world for NFTs, addressing the current fragmentation and complexity in managing digital assets across different blockchains. Introducing Magic Eden Wallet, a wallet made for Magic Eden users and cross-chain collectors. Beta version is now live and only available to a small group of early testers! Want to give it a try? You can get on the waiting list by downloading the extension and entering your… pic.twitter.com/5DsS5qhdlQ — Magic Eden 🪄 (@MagicEden) November 27, 2023 Currently, users engaging with multiple blockchains face the inconvenience of using several wallets, creating a disjointed experience. Magic Eden’s solution, beginning with a Google Chrome extension and with plans for Safari and a mobile app that could be available by next year, aims to streamline this process. The wallet will support Bitcoin, Ethereum, Solana and Polygon, the four blockchains currently integrated with Magic Eden’s NFT marketplace. A notable aspect of this wallet is its self-custody feature, requiring users to manage their seed phrases independently. This choice aligns with the ethos of web3, emphasizing decentralized ownership and control. While this approach resonates with the principles of crypto and NFTs, it does raise questions about user convenience and accessibility, particularly for those less familiar with such security measures. You might also like: Magic Eden welcomes BRC-20 tokens to its multi-chain platform Lu’s awareness of the challenges in the current crypto wallet landscape, including the conflicts arising from multiple browser extensions, indicates a thoughtful approach to design. The collaboration with Exodus aims to mitigate such issues. Additionally, the integration of cross-chain swaps, the ability to purchase crypto with fiat currency via MoonPay and NFT-focused features, such as cross-chain portfolio tracking and Bitcoin Ordinals support, are significant advancements. While the wallet’s self-custodial nature may be seen as a barrier to some, Lu hints at the possibility of integrating more user-friendly features like email login in the future, suggesting a balance between security and ease of use. Read more: Yuga Labs, Magic Eden unveil Ethereum NFT marketplace Follow Us on Google News",
      "tags": [
        "#Magic Eden",
        "#NFT",
        "#wallet"
      ],
      "publishDate": "27/11/2023"
    },
    {
      "id": 21,
      "title": "Web3 edu-tech startup Open Campus raises $3.15m from Binance, EDU jumps 6% Web3 edu-tech startup Open Campus raises $3.15m from Binance, EDU jumps 6%",
      "absoluteURL": "https://crypto.news/web3-edu-tech-startup-open-campus-raises-3-15m-from-binance-edu-jumps-6/",
      "fullContent": "Crypto educational startup Open Campus has raised over $3 million from Binance Labs to double down on NFTs. Open Campus (EDU), a cryptocurrency-focused educational startup, has raised $3.15 million from Binance‘s venture arm Binance Labs. According to an announcement on Monday, Nov. 27, 2023, the funding is expected to help the startup onboard new users onto Web3 and “attract more native users to participate in education through the launch of novel Publisher NFTs.” After the news broke, the project’s native token jumped by more than 6%, reaching in a moment $0.65, according to CoinGecko. EDU price | Source: CoinGecko You might also like: New Binance CEO says company fundamentals remain strong despite $4.3b DoJ fine Yat Siu, who’s the co-founder of Animoca Brands and a council member of Open Campus, said the investment is in line with Open Campus’ mission to “decentralize education and find innovative ways to support educators.” “Digital property rights are coming to education, and that’s why we’re thrilled to have the involvement and support of Binance Labs, which we believe will boost our efforts to onboard educators and content creators worldwide to create and tokenize content via our protocol.” Yat Siu From its inception, Open Campus was supported by the exchange as early as April 2023, when the project first appeared on Binance Launchpad, a crowdfunding platform offered to the exchange’s users. According to the token sale description page, a total of more than 9 million Binance Coin (BNB) (currently worth of $2 billion) was committed for Open Campus from 120,000 users on Binance. Read more: DOJ doc details length of Binance founder Changpeng Zhao’s possible prison sentence Follow Us on Google News",
      "tags": [
        "#Binance",
        "#NFT",
        "#Startup"
      ],
      "publishDate": "27/11/2023"
    },
    {
      "id": 22,
      "title": "Billionaire Mark Cuban eyes blockchain use for real-estate innovation Billionaire Mark Cuban eyes blockchain use for real-estate innovation",
      "absoluteURL": "https://crypto.news/billionaire-mark-cuban-eyes-blockchain-use-for-real-estate-innovation/",
      "fullContent": "Tech entrepreneur and billionaire Mark Cuban expressed interest in a transformative crypto real estate project to integrate smart contracts and non-fungible tokens (NFTs) to facilitate construction and urban development. This development follows a proposal by Jason Calacanis, a serial entrepreneur, to build ten new cities across the US, each housing a million units. These cities are envisioned to redefine urban living with an emphasis on sustainability and affordability. Cuban’s vision for crypto-driven real estate Cuban took the conversation a step further. The billionaire investor’s proposal involves utilizing a blockchain-based smart contract that operates on a layer-2 scaling solution to ensure privacy and efficiency. So you are saying you will have written a smart contract on a ZK L2 which will check for a construction permit being issued , which in turn will create and send me an NFT that unlocks and delivers 250k in USDC when the oracle checks property and utility records and… https://t.co/KxmZ4RdlTH — Mark Cuban (@mcuban) November 26, 2023 According to Cuban, the smart contract is programmed to verify construction permits autonomously using an oracle, a mechanism that feeds external data into the blockchain. Upon successful verification of a permit, the contract then produces an NFT. This NFT represents a developer’s entitlement to receive $250,000 in USDC, a stablecoin, as detailed by Cuban. Cuban also proposes the use of a multi-signature wallet to enhance security and provide mutual protection for the parties involved in the transactions. You might also like: Deutsche-backed Taurus targets tokenized real estate market with Dubai office However, some have raised questions about the necessity of using a ZK-rollup, a complex blockchain solution, for this purpose. In response, Cuban highlighted the simplicity and security advantages of using a multi-signature wallet for managing project funds. Calacanis, on the other hand, recommended the adoption of a more conventional, trust-dependent approach for transferring funds. Cuban’s interest in this innovative blend of cryptocurrency and real-estate mirrors his broader advocacy for the practical and beneficial applications of cryptocurrency beyond mere investment opportunities. In an Oct. 2023 interview, he expressed concerns about the perception of cryptocurrencies, noting, “[m]any associate crypto primarily with speculation. However, that’s not the true essence of what cryptocurrencies represent.” “Crypto is really about creating new applications that make things better and easier. What crypto is missing is that one application that grandma really wants to use.” Mark Cuban Despite his passion for the industry, Cuban has encountered hurdles in his cryptocurrency endeavors. In Sept. 2023, he experienced a significant setback when he fell victim to a cryptocurrency scam, resulting in a loss of nearly $870,000. Cuban was taken by surprise, only becoming aware of the scam after noticing the absence of 5 Ethereum from his wallet, which was worth approximately $8,175 at that time. Read more: Elon Musk and Mark Cuban spoke out against SEC Follow Us on Google News",
      "tags": [
        "#Mark Cuban",
        "#NFT"
      ],
      "publishDate": "27/11/2023"
    },
    {
      "id": 23,
      "title": "Fraudster disguised as Forbes journalist targets BAYC holders Fraudster disguised as Forbes journalist targets BAYC holders",
      "absoluteURL": "https://crypto.news/fraudster-disguised-as-forbes-journalist-targets-bayc-holders/",
      "fullContent": "An attacker pretended to be a Forbes journalist during an interview and tried to steal non-fungible tokens (NFTs) from Bored Ape Yacht Club (BAYC) collectors. The attacker, posing as a Forbes journalist, approached the holder with a request to share his experience with the popular NFT collection BAYC. One of the collectors using the X handle @crumz10 said that he miraculously escaped the scam. 🚨🚨SCAM ALERT!!🚨🚨 I just spent the last 2hours on Zoom with '@Forbes' it was pretty sophisticated and well thought out because I'm usually on high alert but luckily I wasn't caught. Here's what they did. 🧵1/8 — Crumz 🇮🇪 (@crumz10) November 26, 2023 The user immediately noticed several red flags: the scammer did not have a premium subscription to Zoom and wanted to record the screen holder using a strange bot. The interview lasted two hours. At the end, the “journalist” suggested that the victim take a banana to take a photograph for the article. However, @crumz10 realized that in this way the attacker was trying to distract him, and did not leave the computer. Once the user turned off the camera and microphone, the scammer tried to find NFTs to steal. You might also like: Fake Elon Musk YouTube streams lead to $165k crypto scam Another user @3orovik also warned followers about the cunning fraud. He noted that during the interview, the scammer tried to gain access to the user’s computer and steal expensive tokens. Previously, SlowMist analysts shared research on a new wave of thefts. The cybercriminal similarly posed as a famous journalist, called Friend.tech users for an interview, and then tried to hack their accounts. The scammer conducted the interview via Telegram. After the conversation, he asked to fill out a special form, but it contained a phishing link. You might also like: BlackRock reaches police after fake XRP ETF application Follow Us on Google News",
      "tags": [
        "#NFT",
        "#SCAM"
      ],
      "publishDate": "27/11/2023"
    },
    {
      "id": 24,
      "title": "Crypto price-tracking website CoinGecko acquires NFT analytics firm Zash Crypto price-tracking website CoinGecko acquires NFT analytics firm Zash",
      "absoluteURL": "https://crypto.news/crypto-price-tracking-website-coingecko-acquires-nft-analytics-firm-zash/",
      "fullContent": "With the new addition, CoinGecko wants to expand its crypto data API offering and monitor wash trading on marketplaces. Crypto data aggregator CoinGecko is doubling down on the NFT market with the latest acquisition aimed at expanding its API offering data on digital collectibles. In a blog announcement on Wednesday, Nov. 22, CoinGecko said it has acquired Zash, an infrastructure company focused on non-fungible tokens, in a bid to offer more NFT-related metrics such as metadata, historical trades and lending data. The deal price was not disclosed. “We believe that NFTs will continue to evolve and unlock new use cases globally, creating value for companies and consumers.” CoinGecko Founder, Parit Patel CoinGecko plans to roll out new services by Q2, 2024. Users could get access to data across Ethereum, Polygon, BNB Chain (formerly Binance Smart Chain), Bitcoin Ordinals and Solana. In addition to metadata, users will also be able to gather NFT lending information across marketplaces such as Blend, X2Y2 and NFTfi. Among other features, Zash will also make it possible for customers to monitor wash trading. However, this feature will only be available on “major collections” minted on Ethereum, CoinGecko said. You might also like: From millions to pennies: the astonishing decline of iconic NFTs Wash trading has historically been a concern in the NFT market as many blamed this illegal practice of buying and selling assets at the same time as the main reason behind the 2022 NFT bubble. According to a blockchain forensic firm Chainalysis, more than 100 profitable wash traders collectively made nearly $9 million in profit from this activity. Yet, the firm noted that most NFT wash traders “have been unprofitable,” adding that more than 150 wash trades resulted in $416,984 in losses. As of press time, total sales on the market amount to $80.8 million, a far cry from its all-time high from August 2021, when the market generated over $2 billion in daily sales, according to CryptoSlam data. CoinGecko operates as a platform providing data and information on digital currencies, offering tools for users to assess and rank their cryptocurrency holdings quantitatively. Established in Singapore in 2014, the company was co-founded by TM Lee and Bobby Ong. Read more: Navigating the NFT market dip: a shift towards utility Follow Us on Google News",
      "tags": [
        "#CoinGecko",
        "#NFT"
      ],
      "publishDate": "22/11/2023"
    },
    {
      "id": 25,
      "title": "BLUR jumps 12% as Blur founder raises $20m for new L2 network BLUR jumps 12% as Blur founder raises $20m for new L2 network",
      "absoluteURL": "https://crypto.news/blur-jumps-12-as-blur-founder-raises-20m-for-new-l2-network/",
      "fullContent": "Additionally, Blur founder Tieshun Roquerre raised $40 million to contribute to the Blur ecosystem. Tieshun Roquerre, the founder of NFT marketplace Blur (also known as “Pacman”), is launching a new layer-2 network where users can reduce transaction costs for digital collectibles. In a thread posted to X on Nov. 21, Roquerre addressed high network fees, saying “hundreds of millions have been spent on gas trading NFTs.” Two of the biggest opportunities we see for NFTs are reducing transaction costs and institutional-grade NFT perps. Hundreds of millions have been spent on gas trading NFTs, and perp volume is 6x bigger than spot. These opportunities require an L2. — Pacman | Blur.io (@PacmanBlur) November 21, 2023 Moreover, Roquerre says “almost every” decentralized application, or DApp, on a blockchain has an issue when users lock up their funds in pools, which do not generate yield for them. “This means that Blur users are losing money through depreciation. As I dug deeper, I realized that almost every dapp on-chain has this issue.” Tieshun Roquerre In a bid to solve all these issues “at once,” the Blur founder decided to launch Blast, a new layer-2 network with native yield for DApps, where users could avoid asset depreciation as well as reduce transaction costs for non-fungible tokens. For the new venture, Roquerre raised $20 million in funding from Paradigm, Standard Crypto and others. You might also like: NFT giants are protesting Blur and OpenSea over royalty rates To earn yield, Blast “natively” participates in Ethereum (ETH) staking, automatically returning the staking yield to the network’s users and DApps. In addition to ETH, Blast also earns yield for stablecoins with USDB, the network’s native auto-rebasing stablecoin. Additionally, I have raised another $40m to contribute to the Blur ecosystem. The funds will be used to build L2 apps for NFTs and continue advancing NFTs on ETH L1 as well. — Pacman | Blur.io (@PacmanBlur) November 21, 2023 Beyond Blast, Roquerre announced he had raised another $40 million to contribute to the Blur ecosystem. The proceeds are expected to be used for building DApps atop Blast in order to “continue advancing” NFTs on Ethereum as well. Amid the news, Blur’s native token BLUR jumped 12%, surging to $34, according to CoinGecko data. Read more: Blur token skyrockets as NFT sales surpass the $10m mark Follow Us on Google News",
      "tags": [
        "#Blur",
        "#Layer 2",
        "#NFT"
      ],
      "publishDate": "21/11/2023"
    },
    {
      "id": 26,
      "title": "Disney and Dapper Labs to launch NFT mobile app Disney and Dapper Labs to launch NFT mobile app",
      "absoluteURL": "https://crypto.news/disney-and-dapper-labs-to-launch-nft-mobile-app/",
      "fullContent": "Disney is launching a new NFT mobile app developed in partnership with Dapper Labs, featuring unique, badge-inspired digital collectibles. Disney is collaborating with Dapper Labs, popular for developing the NBA Top Shot collection, to introduce a new NFT application called Disney Pinnacle. This app, designed for mobile platforms, is set to feature unique NFTs resembling badges, utilizing the Flow blockchain. Its initial release is scheduled for the Apple App Store, and users can join the waitlist on its official website. Disney is coming to Web3. Dapper Labs is partnering with the $159B entertainment conglomerate to bring Web3 IP to the masses. Do you think the Simpsons NFT episode timing was a coincidence? Disney acquired 21st Century Fox in 2019 which had the rights to the Simpsons. Here's… pic.twitter.com/IEbOGSXS2G — s4mmy.moca (@S4mmyEth) November 14, 2023 Disney Pinnacle had an exclusive early access release for selected users at 9:00 A.M. Following this, the app will become available for web browsers and the Google Play store at a later date, as shared by a Dapper representative with Coindesk. You might also like: OpenSea users targeted in phishing scam disguised as official NFT offers Dapper Labs has a notable track record in the NFT space. They pioneered CryptoKitties, one of the earliest NFT initiatives, which famously clogged up the Ethereum network. In the 2020-21 bull market, Dapper launched NBA Top Shot in collaboration with the National Basketball Association. This platform, centered around trading tokenized NBA highlights, emerged as a standout during the NFT boom. Capitalizing on this success, Dapper expanded its offerings to include digital collectibles from other sports leagues, like the NFL. Be the first to chase, collect and trade digital pins featuring characters you love. Only on Disney Pinnacle. 💫 Join the waitlist at https://t.co/VCeadWRHTU! 🌟 pic.twitter.com/GQa084CkW4 — DisneyPinnacle (@DisneyPinnacle) November 14, 2023 Disney Pinnacle is poised to offer a similar experience, allowing users to exchange digital “pins” featuring Disney’s intellectual properties. This means iconic characters like Baby Yoda, Woody, and Buzz from “Toy Story,” and Snow White could become digital collectibles. Read more: NFT market revives as major collections soar in sales and volume Follow Us on Google News",
      "tags": [
        "#Dapper Labs",
        "#Disney",
        "#NFT"
      ],
      "publishDate": "14/11/2023"
    },
    {
      "id": 27,
      "title": "OpenSea users targeted in phishing scam disguised as official NFT offers OpenSea users targeted in phishing scam disguised as official NFT offers",
      "absoluteURL": "https://crypto.news/opensea-users-targeted-in-phishing-scam-disguised-as-official-nft-offers/",
      "fullContent": "In a Nov. 14 post on X from WuBlockchain, it was confirmed that several community users had reported they received phishing emails from an “Opensea official.” As part of these emails, users were being offered NFTs. Plenty of phish in the sea Recently, a large number of community users have reported that they have recently received phishing emails disguised as Opensea official, with content such as NFT Offers. OpenSea has stated before that user emails and even developer API keys may be leaked because the supplier is… pic.twitter.com/koVH9o6OKG — Wu Blockchain (@WuBlockchain) November 14, 2023 OpenSea has stated before that user emails and even developer API keys may be leaked because the supplier is attacked. At the same time, OpenSea issued a post on Nov. 13 stating that “There’s no hack.” and going on to warn users not to click links they don’t trust. That said, X now contains thousands of tweets about the alleged hacking. You might also like: OpenSea CEO announces layoffs for half of workforce A large target There's no hack. DO NOT click links you don't trust. — OpenSea (@opensea) November 13, 2023 The news follows the announcement from OpenSea’s co-founder and CEO, Devin Finzer, announced job cuts on Nov. 3. According to Finzer’s post, the decision to implement these cuts stemmed from a comprehensive reassessment of OpenSea’s “operating culture, product, and tech from the ground up.” This strategic realignment is a pivotal step within the framework of “OpenSea 2.0” as the prominent digital collectible trading platform endeavors to fortify its position. However, the news has since been overshadowed with skepticism about the alleged phishing scam. Read more: OpenSea rolls out Pro version on Polygon, adds support for cross-chain swaps Follow Us on Google News",
      "tags": [
        "#NFT",
        "#OpenSea",
        "#Phishing"
      ],
      "publishDate": "14/11/2023"
    },
    {
      "id": 28,
      "title": "NFT market revives as major collections soar in sales and volume NFT market revives as major collections soar in sales and volume",
      "absoluteURL": "https://crypto.news/nft-market-revives-as-major-collections-soar-in-sales-and-volume/",
      "fullContent": "Major NFT collections see increased demand as sales and trading volume soar across several networks. As the crypto market rallied after a prolonged crypto winter, the non-fungible tokens (NFT) market also hints at a comeback — the trading volume of several major collections recording significant highs after months of steady decline. NFT markets are rallying again 🔥 Here's all the bullish news you need to know In 4 minutes or less 👇 pic.twitter.com/GuZM6X2zQu — Bankless (@BanklessHQ) November 12, 2023 According to the data from Coingecko, the floor prices of the top 15 NFT collections have significantly soared over the last few days, demonstrating increasing demand. Most notably, the floor price of the Bored Ape Yacht Club (BAYC) collection has increased over 70% in a month, from $24.8 in the first week of October to $30.90 on Nov. 13. BAYC’s 24-hour trading volume has also risen by 51% today, showcasing increased trading across marketplaces. TOP NFTs | Source: CoinGecko The 24-hour trading volume of Captainz, a popular collection from Memeland, soared by over 680% since yesterday. You might also like: CryptoPunks drive NFT surge with $1.1m sale Data from Dune Analytics show that NFT trading volume across major marketplaces in November recorded the highest figures since July. On Nov. 10, daily trading volume reached a four-month high, with Blur accounting for the lion’s share of the trades. NFT trading volume across major marketplaces | Source: Dune In terms of sales volume, CryptoPunks led the way with a 373% increase in weekly sales. BAYC also recorded a 42% increase in sales. Overall, weekly NFT sales increased by over 60% on Ethereum (ETH) and Solana (SOL) networks. Bitcoin’s BRC-20 collections also saw increased demand, with $SATS and $RATS making notable sales over the week. Blockchains by NFT sales volume | Source: CryptoSlam The rising sales and trading volumes suggest a positive Q4 for the NFT market, with increased demand across all major marketplaces. However, the non-fungible tokens market is still a mere shadow of its 2021 peak. If the positive sentiment continues to sustain over the new year, we might see the overall market revive to some extent. Read more: Blur token skyrockets as NFT sales surpass the $10m mark Follow Us on Google News",
      "tags": [
        "#Bored Ape NFT",
        "#Bored Ape Yacht Club",
        "#CryptoPunks",
        "#NFT"
      ],
      "publishDate": "13/11/2023"
    },
    {
      "id": 29,
      "title": "China announces criminal penalties for theft of digital assets including NFTs China announces criminal penalties for theft of digital assets including NFTs",
      "absoluteURL": "https://crypto.news/china-announces-criminal-penalties-for-theft-of-digital-assets-including-nfts/",
      "fullContent": "The Chinese government has officially declared that the theft of digital collections, including NFTs, will be legally treated as property theft, signifying a significant shift in the nation’s approach to digital asset regulation. On Nov. 10, the Chinese government issued a significant statement regarding the legal status of digital collections, including nonfungible tokens (NFTs), within its jurisdiction. This announcement marks a notable stance on digital property rights and cybercrime in a nation known for its stringent regulatory environment. The statement delineated three perspectives on categorizing the theft of digital collections. The first two views classify it either as data theft or digital property theft. However, it’s the third viewpoint, treating digital collections as both data and virtual property, that falls under “co-offending.” “The theft of digital collections violates the protection law and interests of the crime of illegally obtaining computer information system data.” This approach underscores the multi-faceted nature of digital asset theft, involving both intrusion into computer systems and the theft of virtual property. You might also like: Various crypto scams cost users over $32m in October Emphasizing the dual nature of such theft, the statement clarifies that stealing a digital collection involves illicitly accessing the system hosting it, thus constituting a violation of laws protecting computer system data and property rights. The Chinese government labels digital collections as “network virtual property,” asserting their recognition as property in a criminal law context. This classification is crucial, as it implies that digital collections can be the subject of property crimes. NFTs, a technology largely developed abroad, use blockchain to create unique, non-replicable digital assets with secure and permanent storage features. Despite China’s 2021 ban on most cryptocurrency-related activities, the recent developments hint at a nuanced approach towards digital assets like NFTs. Interestingly, there have been indicators of a growing interest in NFTs within China. For instance, Alibaba’s Xianyu removed restrictions on the search terms “nonfungible tokens” and “digital asset” on October 25. Furthermore, on October 6, the state-run China Daily announced plans to develop its own NFT platform, committing 2.813 million yuan, or $390,000, for its design and implementation. Read more: Philippine police release over 1,000 prisoners forced to perform crypto scams Follow Us on Google News",
      "tags": [
        "#China",
        "#NFT",
        "#Theft"
      ],
      "publishDate": "10/11/2023"
    },
    {
      "id": 30,
      "title": "NFT creators say UV lights at ApeFest event caused eye injuries NFT creators say UV lights at ApeFest event caused eye injuries",
      "absoluteURL": "https://crypto.news/nft-creators-say-uv-lights-at-apefest-event-caused-eye-injuries/",
      "fullContent": "Bored Ape Yacht Club (BAYC), creator of the popular Bored Ape nonfungible token (NFT) collection, announced Thursday that ultraviolet lights used during its ApeFest event in Hong Kong last week likely caused eye and skin injuries reported by attendees. BAYC said in a statement posted to Twitter that an investigation undertaken with event producer Jack Morton Worldwide concluded the UV lighting rigs were the “most likely cause” of the medical issues. Some attendees complained on social media of experiencing eye pain and discomfort during the Nov. 3-5 event. BAYC said it has been in contact with those affected. You might also like: Bitcoin Frogs outpaces Bored Apes as the most popular NFT The incident came during a rocky period for BAYC and the NFT market as a whole, which has plunged from historic highs reached during the pandemic. The collectible digital assets, which verify ownership through blockchain technology, surged along with cryptocurrencies like Bitcoin before crashing this year. Jack Morton Worldwide, an experiential marketing agency owned by Interpublic Group, did not immediately respond to a request for comment Thursday. BAYC thanked the community for its patience as the investigation was conducted and said it “committed to supporting the recovery of anyone affected.” Read more: Yuga Labs’ Bored Ape Yacht Club hits 30 ETH floor price Follow Us on Google News",
      "tags": [
        "#Bored Ape Yacht Club",
        "#DeFi",
        "#NFT"
      ],
      "publishDate": "09/11/2023"
    },
    {
      "id": 31,
      "title": "Coatue Management slashes stake in OpenSea by 90% Coatue Management slashes stake in OpenSea by 90%",
      "absoluteURL": "https://crypto.news/coatue-management-slashes-stake-in-opensea-by-90/",
      "fullContent": "Coatue Management, a US-based tech investment firm, has significantly reduced the valuation of its investment in the NFT marketplace OpenSea by 90%. According to reports on Nov. 7, Coatue has slashed its stake from an initial $120 million to a mere $13 million. This adjustment suggests that OpenSea’s valuation is now approximately $1.4 billion. Coatue has also revised the value of its investment in MoonPay, a web3 payment provider, reducing it by the same margin of 90%. In January 2022, OpenSea secured $300 million during a Series C funding round. The round was spearheaded by Paradigm and Coatue, catapulting the valuation of the NFT platform to $13.3 billion at that time. You might also like: OpenSea rolls out Pro version on Polygon, adds support for cross-chain swaps NFTs, which are unique crypto assets, enable owners to authenticate their ownership of various items, whether tangible or digital. The NFT sector, however, has not been immune to the prolonged bear market that has affected the wider crypto industry. As a result, OpenSea announced on Nov. 3 a significant downsizing of its workforce by 50% as part of a strategic move to pivot towards OpenSea 2.0. Devin Fizner, the CEO of OpenSea, said that the revamped platform will enhance its technological framework, focusing on improved performance and quality. Fizner believes a leaner team structure will enable the platform to maintain agility and responsiveness. State of NFT market Despite some indications of recovery in the broader cryptocurrency market, the NFT segment has been sluggish in bouncing back. Recent data indicates a stark decline in NFT transactions, with weekly sales plummeting from around 176,000 at the beginning of the year to approximately 23,000 and the total value of weekly sales falling from $118 million to $62 million. However, there is a glimmer of hope as the NFT market saw its first increase in over a year, with a $99 million rise in October, as reported by DappRadar on Nov. 3. This uptick may signal a slow but steady resurgence in the NFT sector. Read more: NFTs surge following SEC’s failure to appeal Grayscale ETF Follow Us on Google News",
      "tags": [
        "#MoonPay",
        "#NFT",
        "#OpenSea"
      ],
      "publishDate": "08/11/2023"
    },
    {
      "id": 32,
      "title": "Magic Eden enhances Polygon integration with latest feature rollout Magic Eden enhances Polygon integration with latest feature rollout",
      "absoluteURL": "https://crypto.news/magic-eden-enhances-polygon-integration-with-latest-feature-rollout/",
      "fullContent": "Magic Eden has introduced new features to enhance its support for the Polygon network, including an aggregation tool and royalty enforcement for its marketplace. Magic Eden, a notable NFT marketplace, is expanding its services for the Polygon (MATIC) network by introducing a set of innovative features aimed at enhancing user experience. Among these new additions is a sophisticated aggregation tool designed to consolidate NFT listings from various marketplaces, streamlining the process of browsing and purchasing digital assets. https://twitter.com/MEonPolygon/status/1721935721932509523 Magic Eden has also enforced royalty payments on its Polygon-based marketplace. This development ensures that creators continue to receive their due share from secondary sales, a principle that is sometimes contested in the realm of digital assets. You might also like: Yuga Labs, Magic Eden unveil Ethereum NFT marketplace Additionally, Magic Eden is opening up its technological infrastructure to the wider community by making its Polygon API public. This initiative will allow other projects to seamlessly integrate marketplace functionalities, fostering a more interconnected ecosystem. Co-founder and CEO of Magic Eden Jack Lu expressed enthusiasm about the platform’s ongoing ventures with Polygon. Lu anticipates that the introduction of these new tools will attract a more diverse range of collectors, artists, and game developers to the platform, further driving the growth of the Polygon network. Magic Eden, which began as a dedicated marketplace for Solana (SOL)-based digital assets, extended its reach to include Polygon, a Layer 2 Ethereum scaling solution, in late 2022. The platform quickly escalated its support by facilitating the minting and trading of Polygon NFTs, particularly catering to the burgeoning sector of web3 gaming assets. This strategic expansion not only diversifies Magic Eden’s offerings but also strengthens its position in the competitive landscape of NFT marketplaces. Read more: Magic Eden adds support for Solana-powered compressed NFTs Follow Us on Google News",
      "tags": [
        "#Magic Eden",
        "#NFT",
        "#Polygon"
      ],
      "publishDate": "07/11/2023"
    },
    {
      "id": 33,
      "title": "Twitter Discontinues NFT Profile Picture Option, Eliminates Ethereum Integration for Subscribers",
      "absoluteURL": "https://www.todaynftnews.com/twitter-discontinues-nft-profile-picture-option-eliminates-ethereum-integration-for-subscribers/",
      "fullContent": "SNEAK PEEK Twitter, now known as X, has recently phased out the option for premium users to use NFTs as profile pictures, a feature introduced in January to showcase Ethereum-based NFTs. iPhones no longer support Ethereum-based NFTs as profile images, a former hallmark of the platform’s premium services. Amidst evolving priorities in technology and digital finance, Twitter’s move away from NFTs mirrors a broader industry trend, signaling a potential shift in the role of digital assets in social media. Twitter, the social media giant now known as X, recently discontinued its feature for premium subscribers to use non-fungible tokens (NFTs) as profile pictures. This decision marks a notable shift from the platform’s earlier embrace of digital asset integration. Introduced in January, the NFT profile picture option allowed users to display Ethereum-based NFTs as their profile images, showcased within a distinctive hexagonal border. At the time, this move was a nod to the burgeoning world of cryptocurrency and digital art. Subscribers could authenticate their NFT ownership via the blockchain, setting Twitter apart as a forward-thinking player in the social media landscape. However, recent developments have seen a change in strategy. The feature, once a critical selling point for the platform’s premium service, is no longer available, especially on the iPhone version of the app. TechCrunch first reported this and later confirmed by Decrypt, noting the absence of this option in the app’s latest iteration. The removal of this feature comes amidst a broader context of changing priorities in the tech world. Under Elon Musk’s leadership, Twitter had previously been at the forefront of integrating digital assets into mainstream platforms. Meta, another major player, had followed suit but recently dialed back its NFT initiatives on Instagram, shifting focus to AI development and its vision of a metaverse. X has removed support for NFT pfps. Just so you know: Digital property rights are not a joke. If any of you take screenshots of my CryptoPunk and pretend it's yours, I will sue you. pic.twitter.com/SHnSNEjXqo — Farokh (@farokh) January 10, 2024 This shift also coincides with significant events in the cryptocurrency domain. The United States Securities and Exchange Commission (SEC) recently experienced a security breach on Twitter, leading to confusion over the approval of Bitcoin exchange-traded funds (ETFs). This incident highlights the volatile and evolving nature of digital finance and regulation. Twitter’s decision to remove the NFT profile picture feature reflects a broader reassessment of digital asset integration in social media. While the platform had previously embraced this technology, it is recalibrating its approach in a rapidly changing digital landscape. This move might signal a more cautious stance towards incorporating cryptocurrency and NFTs in mainstream applications, a trend that could shape the future interactions between social media, digital art, and finance.",
      "tags": [
        "#Ethereum",
        "#NFT market"
      ],
      "publishDate": "11/01/2024"
    },
    {
      "id": 34,
      "title": "Comparing Bitcoin Ordinals and Off-chain NFT Storage: Insights from Executives on Making the Right Choice",
      "absoluteURL": "https://www.todaynftnews.com/comparing-bitcoin-ordinals-and-off-chain-nft-storage-insights-from-executives-on-making-the-right-choice/",
      "fullContent": "SNEAK PEEK Bitcoin Ordinals Revolutionize Choices Between On-Chain and Off-Chain Solutions Bitcoin Ordinals Spark New Dialogue in Web3 Community Navigating the Maze of NFT Storage In the evolving landscape of digital assets, the debate over the optimal storage method for nonfungible tokens (NFTs) has taken a new turn with the introduction of Bitcoin Ordinals. Experts in the Web3 sector are now guiding creators through the maze of choices between on-chain and off-chain storage for their NFTs. Witek Radomski, co-founder and chief technology officer of Atlas Development, emphasizes the significance of making informed decisions based on the nature of the NFT. Radomski suggests off-chain storage as a cost-effective solution for substantial data handling, likening on-chain storage to a “permanent, tamper-proof vault.” He further highlights the potential of hybrid options like Filecoin and the InterPlanetary File System (IPFS), offering a decentralized yet affordable alternative. The conversation around NFT storage gained urgency following the FTX bankruptcy saga, where off-chain stored NFTs exhibited vulnerabilities, displaying blank images instead of original artworks. Jana Bertram, head of strategy at Rari Foundation, points out that off-chain storage, dependent on network and storage layer accessibility, exposes NFTs to more security risks, questioning their permanence. The introduction of Bitcoin Ordinals has sparked a new dialogue in the community. While these on-chain stored NFTs enjoy the benefits of permanence and security, concerns about their impact on the Bitcoin network’s efficiency have been raised. This development has led to reevaluating the suitability of different blockchain networks for NFT storage. Bertram suggests a purpose-driven approach to this dilemma. She argues that the intended use of an NFT should dictate its storage location. For example, NFTs representing significant assets like house titles may require the security of on-chain storage, whereas less critical applications like brand loyalty programs could suffice with off-chain solutions. The shifting dynamics in NFT storage underscore the importance of balancing security and scalability. As the industry continues to evolve, creators and developers are encouraged to carefully assess the specific needs of their NFTs to determine the most appropriate storage solution. This careful evaluation ensures the longevity, accessibility, and security of digital assets in the rapidly changing world of Web3 technology.",
      "tags": [
        "#Bitcoin Ordinals",
        "#NFT market"
      ],
      "publishDate": "09/01/2024"
    },
    {
      "id": 35,
      "title": "Logan Paul Announces $2.3 Million Buy-Back Program for Failed CryptoZoo NFT Game",
      "absoluteURL": "https://www.todaynftnews.com/logan-paul-announces-2-3-million-buy-back-program-for-failed-cryptozoo-nft-game/",
      "fullContent": "SNEAK PEEK Logan Paul’s $2.3 million buy-back program relieves disappointed CryptoZoo NFT investors. The buy-back terms specify 0.1 ETH per qualifying NFT, excluding hybrid animal NFTs and ZOO token holders. Paul’s lawsuit against CryptoZoo developers shifts blame and marks the end of the CryptoZoo project. Logan Paul, a YouTuber, has announced a buy-back program for his failed CryptoZoo NFT game. This decision comes as a relief to many disgruntled investors. Initially revealed in August 2021, CryptoZoo promised a unique play-to-earn experience. However, the game never saw the light of day, leading to widespread disappointment among its backers. Significantly, Paul has committed a substantial $2.3 million to fund this initiative. The program focuses on repurchasing Base Eggs and Base Animals at their original prices. This gesture shows Paul’s commitment to rectifying the situation, albeit belatedly. Investors can submit claims on the dedicated website, “EGGNFTBUYBACK.COM,” until February 8. Moreover, the terms of the buy-back are quite specific. Eligible participants will receive 0.1 ETH, equivalent to $224, for each qualifying NFT. It’s crucial to note that hybrid animal NFTs and CryptoZoo (ZOO) token holders are not included in this scheme. Additionally, those participating in the buy-back must forgo any future legal claims against Paul and related personnel. Furthermore, in a post on X (formerly Twitter), Paul expressed his disappointment over the project’s failure. He assured his 6.8 million followers that he had not profited from the venture. This statement aims to restore trust among his followers and the broader crypto community. Today, I am incredibly happy to announce that I am delivering on my promise to buy back Base Egg and Base Animal CryptoZoo NFTs for their original purchase price. This buy-back program is being carried out at https://t.co/XIQzLAGKiG. Claims can be submitted through this site… pic.twitter.com/VMPDHvdXkq — Logan Paul (@LoganPaul) January 4, 2024 However, the situation takes a more complex turn when Paul files a lawsuit against CryptoZoo’s lead developers, Eduardo Ibanez and Jake Greenbaum. He accuses them of sabotaging the game and engaging in fraudulent activities. This legal action shifts the blame away from Paul, highlighting internal conflicts within the CryptoZoo team. Additionally, Paul has confirmed the permanent shelving of CryptoZoo. He cites financial limitations and regulatory hurdles as the primary reasons. This announcement marks the end of a once-promising venture in the NFT gaming space. Logan Paul’s buy-back program represents a significant effort to address the fallout from the CryptoZoo debacle. It is a cautionary tale in the volatile world of cryptocurrency and NFTs. Investors and enthusiasts will closely monitor how this situation unfolds, hoping for a fair resolution.",
      "tags": [
        "#Blockchain",
        "#Gaming",
        "#NFT market"
      ],
      "publishDate": "05/01/2024"
    },
    {
      "id": 36,
      "title": "Chiliz Chain Integrates Rarible Protocol for NFT Innovation",
      "absoluteURL": "https://www.todaynftnews.com/chiliz-chain-integrates-rarible-protocol-for-nft-innovation/",
      "fullContent": "SNEAK PEEK Chiliz Chain-Rarible integration brings cost-effective, custom NFT marketplaces, boosting SportFi and digital collectibles. Rarible Protocol’s multi-chain SDK on Chiliz Chain enhances NFT accessibility, fostering a diverse ecosystem for creators. The partnership elevates Chiliz Chain as a hub for sports brands in Web3, driving innovation in SportFi applications. Chiliz, the premier blockchain provider for sports and entertainment, has officially integrated Rarible Protocol into the Chiliz Chain. This move signals a transformative phase for NFT marketplaces and digital collectibles. The collaboration paves the way for developers to create customized NFT marketplaces. Hence, it boosts the NFT domain, especially in SportFi dApps, wallets, and marketplaces. Rarible Protocol, known for its decentralized toolkit, simplifies NFT interactions. It offers enforced royalties, multi-chain aggregation, and fast indexing features. Its versatility is evident in its blockchain-agnostic nature. Moreover, the Multichain SDK allows developers to query, issue, and trade NFTs easily. The protocol also serves as a rich source of NFT-related data, both on-chain and off-chain. Consequently, it fosters a comprehensive NFT ecosystem for IP owners and content creators. Additionally, this integration focuses on performance and cost-effectiveness. Rarible’s commitment to low gas consumption aligns with Chiliz’s vision for a user-friendly NFT experience. Features like fee splitting and smart contract optimization will reduce costs. This makes NFT transactions more accessible. The Rarible Protocol is significantly governed by $RARI holders and the delegate community. It allows the introduction of front-end fees, creating new monetization avenues for creators. This, combined with a robust and user-friendly tech stack, opens up a variety of NFT marketplaces and digital collectibles. It enriches the Chiliz ecosystem, offering a diverse range of applications. Chiliz Chain is evolving as a leading platform for sports brands in web3. It encourages builders to explore innovative SportFi applications. Chiliz Chain, a Layer-1 EVM-compatible blockchain, is backed by the Chiliz native token CHZ. It powers Socios.com, a major Web3 consumer-facing product with a global user base of over two million. Rarible, a leading NFT platform, supports established and emerging brands and creators. It offers a multi-chain aggregated marketplace, a self-serve marketplace builder, and a white-glove service for custom marketplaces. These products help brands and creators succeed at every stage of their NFT journey. With this integration, Chiliz and Rarible are set to revolutionize the NFT marketplace landscape, enhancing user experience and opening new opportunities for digital collectibles.",
      "tags": [
        "#Blockchain",
        "#NFT market",
        "#Rarible"
      ],
      "publishDate": "04/01/2024"
    },
    {
      "id": 37,
      "title": "Solana NFT Sales Surge, Exceeding Ethereum in Monthly Volume for the First Occasion",
      "absoluteURL": "https://www.todaynftnews.com/solana-nft-sales-surge-exceeding-ethereum-in-monthly-volume-for-the-first-occasion/",
      "fullContent": "SNEAK PEEK In December 2023, Solana’s NFT sales reached approximately $366.5 million, surpassing Ethereum’s $353.2 million for the first time. Solana witnessed a significant increase in market activity, with around 279,000 buyers and 6.6 million transactions. The surge in Solana’s market is partly attributed to the 71% appreciation of its native token, SOL. In a remarkable shift in the digital asset marketplace, Solana’s NFT sales have eclipsed Ethereum’s for the first time, signaling a significant change in the sector. December 2023 witnessed Solana’s NFT sales reaching approximately $366.5 million, surpassing Ethereum’s $353.2 million. This data from CryptoSlam highlights a pivotal moment in the NFT market, considering Ethereum’s long-standing dominance. Solana’s remarkable performance isn’t just about the total sales volume. The network also saw a dramatic increase in unique buyer and seller participation. There wereAboutellers and 279,000 buyers on Solana, engaging in 6.6 million transactions. This contrasts sharply with Ethereum’s figures, which comprised approximately 114,000 sellers and over 143,000 buyers in around 698,000 transactions. The surge in Solana’s NFT market activity aligns with the significant appreciation in its native token, SOL. Over the past month, SOL’s value increased by over 71%, starkly contrasting Ethereum’s 9% rise in the same period. This price rally in SOL contributes to the increased value of Solana’s NFT sales. However, the value of individual NFT sales on Solana decreased from about $74 in November to under $56 in December. This indicates that the surge in sales volume is more due to increased participation and transaction numbers rather than higher-priced sales. Furthermore, specific projects on the Solana network have garnered significant attention. For instance, the Tensorians project, linked to the leading Solana marketplace Tensor, accounted for $28 million in trades. This suggests a growing interest in unique projects within the Solana ecosystem. Meanwhile, the traditional leader in the NFT space, Ethereum, saw its top projects, like the Bored Ape Yacht Club and Pudgy Penguins, generate $19.5 million and $18.3 million in trades, respectively. While impressive, these figures are overshadowed by Solana’s recent surge. An exciting aspect of the broader NFT market is the rise of Bitcoin Ordinals. Ordinals, which allow NFT-like media to be placed on the Bitcoin blockchain, saw significant trading volumes. However, it’s crucial to differentiate the nature of these trades from those on Ethereum and Solana, as Ordinals include trading of BRC-20 tokens, akin to fungible tokens on other networks. In summary, Solana’s recent performance in the NFT market is noteworthy. It marks a shift in the digital asset landscape, reflecting changing preferences and the dynamic nature of the NFT space. While Ethereum remains a significant player, Solana’s emerging prominence is a development worth watching.",
      "tags": [
        "#Ethereum",
        "#NFT market",
        "#Solana"
      ],
      "publishDate": "03/01/2024"
    },
    {
      "id": 38,
      "title": "Former President Trump Shifts Strategy, Liquidates Ethereum Holdings Amid NFT Market Challenges",
      "absoluteURL": "https://www.todaynftnews.com/former-president-trump-shifts-strategy-liquidates-ethereum-holdings-amid-nft-market-challenges/",
      "fullContent": "SNEAK PEEK Former President Donald Trump has sold approximately 1,075 ETH, generating around $2.4 million. This sale marks a significant change in Trump’s cryptocurrency investment approach. The move comes amidst diminishing returns from his NFT trading card business, including the less successful “Mugshot Edition. In a notable shift in digital asset strategy, former President Donald Trump has recently liquidated a substantial portion of his Ethereum holdings. According to detailed reports from Arkham, a leading blockchain intelligence firm, Trump offloaded approximately 1,075 ETH in the past three weeks. This move generated around $2.4 million, marking a significant pivot in his approach to cryptocurrency investments. Trump’s decision to sell comes in the wake of challenges faced by his NFT trading card business. Despite an initially promising start, with values appreciating significantly post-launch last December, the venture has since encountered diminishing returns. His second collection, introduced in April, struggled to surpass its initial minting price of $99. The recent “Mugshot Edition,” featuring images from his booking in Georgia, further reflected a downturn, with less than half of the 100,000 collections minted and a notable drop in floor prices for his previous NFT collections. Despite these sales, Trump’s crypto portfolio remains diverse and substantial. Arkham’s analysis reveals holdings, including $1.4 million in ETH, $649,000 in WETH, and smaller amounts in niche cryptocurrencies like MAGA coin, Pepecoin, and JESUS coin. Looks like Donald Trump is selling his ETH. 3 weeks ago he started sending ETH to Coinbase after months of accumulating Trump NFT royalties. His peak balance was $4 million. Based on the deposits, so far he's sold 1,075 ETH for $2.4 million. pic.twitter.com/JZzA3cS2je — Arkham (@ArkhamIntel) December 27, 2023 These financial maneuvers occur amidst a backdrop of significant legal challenges for Trump. Facing four ongoing criminal prosecutions, he recently disclosed over $100 million in legal fees at a campaign rally. This revelation has fueled speculation about the potential influence of these financial pressures on his recent cryptocurrency transactions. The crypto community’s reaction to Trump’s Ethereum divestment has been mixed. Some Twitter users expressed disappointment at his departure from a long-term Ethereum investment strategy. Meanwhile, others humorously suggested a possible pivot to Solana, a rival blockchain network. Trump has not publicly commented on the strategic reasoning behind his crypto sell-offs. However, this development underscores the volatile and unpredictable nature of the cryptocurrency market, where even high-profile investors like Trump must navigate shifting trends and sentiments. As the digital asset landscape continues to evolve, Trump’s recent Ethereum liquidation serves as a reminder of cryptocurrency investments’ dynamic and often unpredictable nature. This move, possibly driven by a combination of market analysis and personal financial needs, reflects the complex interplay of factors influencing decisions in the crypto space.",
      "tags": [
        "#Donald Trump NFT",
        "#Ethereum",
        "#NFT market"
      ],
      "publishDate": "29/12/2023"
    },
    {
      "id": 39,
      "title": "ZachXBT Accuses Gamegear Developer ‘Scaredofboobs’ of Being an NFT Scam Artist",
      "absoluteURL": "https://www.todaynftnews.com/zachxbt-accuses-gamegear-developer-scaredofboobs-of-being-an-nft-scam-artist/",
      "fullContent": "SNEAK PEEK ZachXBT, an on-chain sleuth, has identified ‘scaredofboobs’ as the person behind the NFT Machine scandal. ‘scaredofboobs,’ also known for developing Gamegear, is allegedly Tyler Gaye, accused of defrauding investors in an NFT scheme. Reports claim that Gaye raised $55,000 for an NFT marketplace, OpenFT, but instead used the funds for personal gains. In a recent development that has stirred the cryptocurrency community, on-chain sleuth ZachXBT has identified X user ‘scaredofboobs,’ known for their involvement in Solana intelligent contract development, as the person behind the notorious NFT Machine scandal. This revelation, made through a Telegram post on December 28, has raised serious concerns among crypto enthusiasts and investors. ‘scaredofboobs,’ also the developer of Gamegear, a web-based platform offering retro games, is allegedly Tyler Gaye. According to ZachXBT’s investigative findings, Gaye, a self-proclaimed open-source code publisher, is accused of defrauding investors through his NFT Machine venture. Reports suggest that Gaye raised $55,000 from investors under the guise of developing an NFT marketplace, OpenFT. However, instead of fulfilling his promise, he allegedly diverted these funds to acquire personal NFTs, including several from the MoonCats collection. The severity of these allegations is compounded by the fact that Gaye reportedly failed to attend court proceedings, leading to a default judgment against him. He was ordered to pay back the invested amount and additional punitive damages, totaling $275,000. Despite this, ZachXBT claims that Gaye needs to pay more attention to repay investors and has continued to launch new crypto projects. ArcadeDAO, a retro gaming project, is cited as a recent example of his ongoing activities in the crypto space. This controversy again highlighted the risks associated with the burgeoning world of cryptocurrency and NFTs. It also underscores the critical role of on-chain sleuths like ZachXBT in uncovering fraudulent activities and protecting the interests of investors. As the community reels from this latest scam, it is a stark reminder of the need for vigilance and due diligence in the ever-evolving and unpredictable world of digital assets.",
      "tags": [
        "#NFT market",
        "#NFT Scams"
      ],
      "publishDate": "29/12/2023"
    },
    {
      "id": 40,
      "title": "Etherscan Introduces Updated Functionality for Renewing NFT Metadata",
      "absoluteURL": "https://www.todaynftnews.com/etherscan-introduces-updated-functionality-for-renewing-nft-metadata/",
      "fullContent": "SNEAK PEEK Etherscan, a prominent blockchain explorer, has launched a beta feature for refreshing NFT metadata, allowing users to update their digital assets. This new tool, requiring users to be logged in and limiting access to verified addresses, aims to minimize spam and streamline asset management. The capabilities of Etherscan’s feature are under assessment, with comparisons drawn to similar functions on the NFT marketplace OpenSea. Etherscan, a renowned blockchain explorer, has recently launched a new feature for refreshing NFT metadata, offering users an innovative tool to update their digital assets. This development, currently in its beta phase, requires users to be logged into their Etherscan accounts, and it may take several minutes for the refresh process to complete. The feature allows only “verified addresses” to be connected to user accounts, aiming to reduce the risk of spamming activities. The exact capabilities of this tool are still being assessed while it’s unclear if users can modify the metadata or if it’s strictly a refresh function similar to the one available on the NFT marketplace OpenSea, the tool’s introduction has sparked user discussions. This could signal a shift in how NFTs are traded, potentially reducing reliance on traditional marketplaces. Furthermore, this feature marks a significant step in Etherscan’s evolution. Traditionally used for tracking and reading transactions on the Ethereum blockchain, Etherscan has also enabled minting NFTs directly from smart contracts. Introducing this metadata refresh tool could begin the platform’s broader range of services. Ethereum, the underlying blockchain for Etherscan, continues to innovate despite the ongoing bear market. Noteworthy developments include the successful transition from Proof-of-Work to Proof-of-Stake through The Merge. Additionally, Ethereum has witnessed the rise of Ordinals, where images are inscribed using transaction call data, highlighting a cost-effective method for creating NFTs and meme coins. Another significant trend on Ethereum has been the surge in the trading volume of Ethereum domain names on OpenSea. These domain names, managed by the Ethereum Name Service (ENS), simplify transactions by providing concise aliases for otherwise complex Ethereum addresses. This surge reflects ENS domain names’ popularity and practicality in the Ethereum ecosystem. Lastly, an innovative proposal by an Ethereum researcher to incorporate zk-SNARKs technology for anonymizing NFT trades has garnered attention. While Ethereum co-founder Vitalik Buterin praised the idea, he noted the need for a lighter technology to implement it effectively. Etherscan’s new feature for refreshing NFT metadata is a notable addition to its services, reflecting the platform’s adaptive evolution. Concurrently, Ethereum continues to be a hub of innovation, demonstrating resilience and adaptability in a challenging market environment.",
      "tags": [
        "#Blockchain",
        "#NFT market"
      ],
      "publishDate": "27/12/2023"
    },
    {
      "id": 41,
      "title": "Sotheby’s NFT Market Nears $1 Billion Amid Rising Bitcoin Value",
      "absoluteURL": "https://www.todaynftnews.com/sothebys-nft-market-nears-1-billion-amid-rising-bitcoin-value/",
      "fullContent": "SNEAK PEEK Sotheby’s achieved a remarkable $35 million in digital art sales in 2023, marking a significant year for the industry. The auction house hosted its first live digital art auction, attracting 300 attendees and generating $12 million. Sotheby’s Metaverse, an on-chain marketplace for NFTs, was launched, reinforcing its commitment to digital art. In a remarkable display of digital art’s burgeoning market value, Sotheby’s, the esteemed British-American auction house, has achieved a staggering $35 million in sales this year. This figure, disclosed by Michael Bouhanna, the Vice President and head of digital art at Sotheby’s, underscores 2023 as a pivotal year for the digital art domain. Sotheby’s has embraced the digital revolution, hosting its first live digital art auction with 300 attendees and generating $12 million. This event forms part of the over 25 auctions conducted by the house this year, either dedicated to digital art or incorporating it within contemporary art sales. Highlighting its commitment to this new era of art, Sotheby’s also launched Sotheby’s Metaverse, an on-chain marketplace designed for the secondary trade of Non-Fungible Tokens (NFTs). A landmark sale was the NFT titled “Ringers #879” by digital artist Dmitri Cherniak, which fetched $6.2 million, setting a record for the highest fee for a digital artwork at Sotheby’s. This sale, among others, signals a robust interest and confidence in digital art as a valuable asset. Moreover, Sotheby’s has witnessed a substantial increase in overall trade volume, nearing $1 billion in November. The average value of NFT transactions during this period spiked by 114%, indicating a growing inclination among users towards higher-value trades. This trend aligns with the recent Bitcoin bull run, further energizing the NFT market. Sotheby’s plans to continue this momentum in 2024, focusing on supporting creators and enhancing their primary market strategies. This strategic move highlights the auction house’s dedication to selling digital art and fostering the growth of digital artists and the ecosystem surrounding them. Sotheby’s initial foray into the NFT market began in April 2021 with Pak, a pseudonymous digital artist, auctioning work. Since then, the auction house has been a consistent presence in the digital art scene, facilitating several record-breaking sales and establishing itself as a significant player in this evolving market. The ascent of Sotheby’s in the digital art sphere, marked by these impressive sales figures and strategic initiatives, reflects digital art’s growing acceptance and valuation in the broader art market. This shift heralds a new era in the art world, where traditional and digital forms coexist and thrive, enriching the landscape with diverse and innovative expressions of creativity.",
      "tags": [
        "#Bitcoin",
        "#NFT market"
      ],
      "publishDate": "26/12/2023"
    },
    {
      "id": 42,
      "title": "China Unveils Web3 Strategy to Bolster NFT and Blockchain Innovation",
      "absoluteURL": "https://www.todaynftnews.com/china-unveils-web3-strategy-to-bolster-nft-and-blockchain-innovation/",
      "fullContent": "SNEAK PEEK China’s Ministry of Science and Technology, the Chinese Academy of Sciences and the China Association for Science and Technology. The strategy aims to provide direction and support for the Web3 industry, highlighting the importance of innovation, security, and the government’s role. The announcement indicates China’s commitment to exploring new business models like Non-Fungible Tokens and distributed applications. China’s Ministry of Science and Technology, in a collaborative initiative with the Chinese Academy of Sciences and the China Association for Science and Technology, announced the release of a comprehensive Web3 strategy. This strategic document aims to provide clear direction and support for the burgeoning Web3 industry, underscoring the importance of innovation, security, and government roles in this sector. The ministry’s announcement, delivered on Tuesday, emphasizes a solid commitment to exploring new business models like Non-Fungible Tokens (NFTs) and distributed applications (dApps). This move is particularly noteworthy given China’s current stance on cryptocurrencies, demonstrating the country’s interest in the broader potential of blockchain technology beyond crypto. Moreover, the ministry highlighted the significance of reinforcing collaborations across various departments to foster Web3 innovation. This approach includes further research initiatives and a focus on cultivating industry talent, ensuring a robust infrastructure for the evolving digital ecosystem. In recent times, China has already witnessed several Web3-oriented initiatives. These include policy documents such as “Guiding Opinions on Accelerating the Application of Blockchain Technology and Industrial Development” and “Blockchain Information Service Management Regulations.” These policies, formulated by the Technology Ministry and the Cyberspace Administration of China, lay the groundwork for the planned Web3 advancements. Additionally, blockchain pilot projects have been conducted across various sectors, such as energy, legal, copyright, and trade finance. These initiatives, undertaken by the Cyberspace Administration of China and other departments, indicate a methodical approach to integrating blockchain technology into multiple facets of society. In the future, Web3 strategies will center on crucial areas like government affairs and industrial applications. The ministry aims to expedite the adoption of Web3 technologies and the establishment of a digital ecosystem, charting a path forward in a rapidly evolving digital landscape. This strategic document paves the way for innovative applications in Web3 and represents a significant step in China’s digital transformation journey. By embracing the potential of blockchain and related technologies, China positions itself at the forefront of the digital era.",
      "tags": [
        "#Blockchain",
        "#China",
        "#NFT market",
        "#Web3"
      ],
      "publishDate": "21/12/2023"
    },
    {
      "id": 43,
      "title": "Modex Announces New NFT Release in Collaboration with FIFA+ Collect",
      "absoluteURL": "https://www.todaynftnews.com/modex-announces-new-nft-release-in-collaboration-with-fifa-collect/",
      "fullContent": "SNEAK PEEK Modex, in partnership with FIFA+ Collect Club, recently achieved a sold-out debut NFT drop in just three hours. A new NFT collection, including 900 unique items, featuring exclusive experiences from the FIFA Club World Cup 2023, will be launched on OpenSea. The collection will be issued on the Polygon network, emphasizing the growing demand for sports-related digital collectables. Modex, in partnership with FIFA+ Collect Club, recently achieved a remarkable milestone with their debut NFT drop, which sold out in three hours. Building on this success, the company has announced a new NFT collection set to be launched on OpenSea, available from December 19 at 11 AM EST. This collection, issued on the Polygon network, will include 900 unique NFTs featuring exclusive VIP experiences and physical items from the FIFA Club World Cup 2023™. The initial success story began with FIFA+ Collect Club’s limited edition NFT Membership Cards, each priced at $999. These cards garnered an overwhelming response, selling out swiftly within three hours of their release. This rapid sellout underscores the growing enthusiasm and market demand for sports-related digital collectables. Adding to the excitement, Modex has revealed a special airdrop scheduled for December 26 for VIP Membership Card holders. This airdrop will feature key moments from the FIFA Club World Cup Saudi Arabia 2023™. Notably, selected moments in this airdrop will offer holders exclusive tickets to the FIFA World Cup 2026™ and FIFA Club World Cup 2025™ finals in the USA. Moreover, holders of these VIP cards will enjoy additional perks, such as the Adidas Level 4 membership. This status is usually reserved for customers who accumulate over 9,000 points from Adidas purchases. This move signifies Modex’s commitment to providing value-added experiences to its NFT collectors. The upcoming NFT Drop on OpenSea is poised to offer a range of unique items. These include tickets to “The Best FIFA Football Awards™”, VIP visits with a FIFA Legend to the FIFA Museum in Zurich, and memorabilia like signed Yellow/Red cards by referees and corner flags signed by team captains from the FIFA Club World Cup 2023™ Saudi Arabia. Additionally, the collection will feature 812 uniquely numbered posters representing each team from the tournament. This series of events illustrates the growing synergy between digital art, sports fandom, and blockchain technology. Modex’s strategic alliance with FIFA+ Collect Club has not only catered to the sports memorabilia market but also introduced a new way for fans to connect with their favourite sports events through innovative digital means. This collaboration is a testament to the evolving landscape of sports collectables and the potential of NFTs in enhancing fan experiences.",
      "tags": [
        "#Blockchain",
        "#FIFA",
        "#NFT market"
      ],
      "publishDate": "20/12/2023"
    },
    {
      "id": 44,
      "title": "OKX NFT Marketplace Sets New Standard in Daily Trading Volumes, Surpassing Blur and OpenSea",
      "absoluteURL": "https://www.todaynftnews.com/okx-nft-marketplace-sets-new-standard-in-daily-trading-volumes-surpassing-blur-and-opensea/",
      "fullContent": "SNEAK PEEK OKX NFT Marketplace, a subsidiary of the crypto exchange OKX, reached a monumental $50 million in trading volume within just 24 hours. This significant achievement eclipsed the combined trading volumes of competitors Blur, Magic Eden, and OpenSea, which totaled around $24 million. The surge in OKX NFT Marketplace’s trading activity follows its recent integration of Bitcoin Ordinals trading, marking a strategic and successful move. The digital trading realm witnessed a significant shift as OKX NFT Marketplace, a renowned crypto exchange OKX subsidiary, soared to new heights in daily trading volumes. On December 18, this bustling marketplace registered an impressive $50 million in trades within 24 hours. This feat notably eclipsed the combined efforts of its closest competitors, Blur, Magic Eden, and OpenSea, who collectively achieved around $24 million in the same timeframe. This remarkable surge in trading volume at OKX NFT Marketplace comes after its recent integration of Bitcoin Ordinals trading. This strategic move has catalyzed a spike in activity, aligning with broader market trends that saw a remarkable week for Bitcoin network sales. According to data from NFT tracker CryptoSlam, the Bitcoin network alone amassed a staggering $367 million in sales volume over the past week, outpacing the combined weekly books of Ethereum and Solana, which stood at $91 million. Guess which #Bitcoin NFT collections are in the gallery 🎨👇   ________________ ╱| ______________ ╱| | |🟧🟧🐸🟧🟧|  | | |🟧🐀🟧🗺️🟧|  | | |🦧🟧👨‍🦲🟧🪨|  | |╱ ￣ ￣￣💃￣ ￣ |╱ ￣￣🚶￣￣👫￣ — OKX (@okx) December 18, 2023 The dominance of OKX NFT Marketplace on December 18 is a testament to its growing influence in the NFT sector. While the trading volume slightly dipped to $35 million later today, the platform’s performance remains a clear indicator of its emerging leadership. Moreover, the broader NFT market is also witnessing a resurgence. November saw the collective volume of the NFT space approaching the $1 billion mark. Notably, the average value of NFT transactions in this period shot up by 114%, escalating from $126 to $270. This trend highlights growing confidence among traders, signalling a willingness to engage in higher-value exchanges compared to previous months. OKX NFT Marketplace’s achievement is more than a mere numerical triumph. It underscores a shift in trader preference and market dynamics within the NFT space. As the marketplace continues to innovate and adapt, its impact on the digital trading landscape is poised to expand, marking a new era of NFT trading that aligns with evolving consumer behaviours and market trends.",
      "tags": [
        "#NFT Marketplace",
        "#OKX Exchange",
        "#OpenSea"
      ],
      "publishDate": "19/12/2023"
    },
    {
      "id": 45,
      "title": "BetFury Launches Exclusive NFT Lootboxes",
      "absoluteURL": "https://www.todaynftnews.com/betfury-launches-exclusive-nft-lootboxes/",
      "fullContent": "SNEAK PEEK BetFury has introduced NFT Lootboxes, marking its entry into the NFT ecosystem. Players have a chance to win rare NFTs and other rewarding prizes. NFT Lootboxes on BetFury offer over a 90% chance of winning a profitable prize, distinguishing them in the crypto space. BetFury has rolled out its latest offering, NFT Lootboxes, marking the platform’s entry into the NFT ecosystem. These Lootboxes promise a chance to win rare NFTs and a slew of other lucrative rewards. For a mere few dollars, players have the opportunity to become the first fortunate winners of coveted art masterpieces. Lootboxes, a popular feature in the gaming world, have made their way into the crypto industry. BetFury has taken this concept and elevated it by incorporating high-quality NFTs as the main rewards. What sets these NFT Lootboxes apart is their impressive over 90% chance of winning a profitable prize, making them a simple yet rewarding addition to the platform. Rewards Inside the Lootboxes BetFury’s NFT Lootboxes offer a variety of rewards, each with a different probability of dropping NFTs. Besides the chance to win NFTs, players can also get rewards such as BTC, ETH, USDT, BNB, TRX, free spins for various games, free bets for sports betting, and the platform’s native token, BFG. While standard NFT Lootboxes guarantee prizes, the premium ones may have a sector without a reward, but even this occurs with only a 1% probability. The chances of leaving empty-handed are minimal, and users can explore the Lootboxes through a demo spin before diving into real-money gameplay. Epic Win: Realizing Profits A recent success story on BetFury involves a user winning Bored Ape Yacht Club #5663. Despite a slim 0.77% chance of success, the $1,657 spin resulted in an NFT worth an impressive $76,545. This triumph showcases that NFT Lootboxes can indeed deliver substantial profits, enabling users to achieve remarkable success. The allure of NFT Lootboxes lies in the opportunity to obtain some of the rarest NFTs on the market, presenting an exclusive chance to acquire valuable items for just a few dollars. BetFury’s Lootboxes feature blue-chip collections, including Wrapped Cryptopunks, Bored Ape Yacht Club, Azuki Originals, Mutant Ape Yacht Club, Pudgy Penguins, DeGods, and many more. BetFury offers a range of NFT Loot Boxes catering to different budgets and preferences, allowing users interested in rare NFTs and other luxury rewards to choose options that suit their preferences. BetFury stands as an ecosystem of crypto products designed for entertainment and additional income. With its native BFG token, listed on major crypto exchanges, BetFury offers over 8,000 slots and original games, 80+ sports options, and lucrative bonuses, making it a comprehensive platform for crypto enthusiasts seeking both entertainment and financial gains.",
      "tags": [
        "#Blockchain",
        "#NFT market"
      ],
      "publishDate": "19/12/2023"
    },
    {
      "id": 46,
      "title": "Blockchain Networks Face Unprecedented Surge in Transaction Fees Amidst EVM Inscription Boom",
      "absoluteURL": "https://www.todaynftnews.com/blockchain-networks-face-unprecedented-surge-in-transaction-fees-amidst-evm-inscription-boom/",
      "fullContent": "SNEAK PEEK The Ethereum Virtual Machine (EVM) ecosystem witnessed a significant rise in transaction fees, driven by growing interest in EVM inscriptions. Gas fees reached record highs, with Dune Analytics reporting costs of $8.3 million on December 16, predominantly in Avalanche and Arbitrum One networks. Arbitrum One faced a 78-minute outage, illustrating the strain of increased inscription activity on blockchain infrastructures. The digital landscape of blockchain technology recently experienced a seismic shift, particularly in the Ethereum Virtual Machine (EVM) ecosystem, where a significant uptick in transaction fees was observed. This phenomenon, largely driven by the rapidly growing interest in EVM inscriptions, marked a notable milestone in blockchain activity over the past weekend. The rise in EVM chain activities led to a record-breaking increase in gas fees, with figures reaching a new zenith. According to the latest insights from Dune Analytics, the cost of inscriptions escalated to a staggering $8.3 million on December 16. Among the networks, Avalanche witnessed the heftiest gas expenses, accounting for more than $5.6 million that day. Not far behind, Arbitrum One recorded around $2.1 million in gas fees due to inscription activities. This trend transcended the Ethereum ecosystem, impacting the Bitcoin network as well. The surge in Bitcoin inscriptions led to a significant demand for block space, resulting in an extensive queue of almost 280,000 unconfirmed transactions. The heightened activity pushed Bitcoin transaction fees to a peak of $37, presenting a challenge for smaller, peer-to-peer transactions on the network. Top 10 Ordinal PFP Collections Ranked by Market Cap: RANK COLLECTION MCAP 1 Bitcoin Frogs $182.2M 2 OMB $79.3M 3 OCM Genesis $38.1M 4 Bitcoin Punks $29.4M 5… — Leonidas (@LeonidasNFT) December 17, 2023 The heightened inscription activity has been challenging. For instance, the Arbitrum One network grappled with a 78-minute outage on December 15, highlighting the stress these activities can place on blockchain infrastructures. Amid these developments, EVM inscriptions are gaining traction, similar to the Ordinals on the Bitcoin network. These inscriptions involve embedding unique information within transaction call data to create distinct, on-chain, nonfungible tokens (NFTs). The interest in this area is palpable, evidenced by the Bitcoin Frogs Ordinals collection’s market capitalization soaring to $182 million. Industry veterans, including Bitcoin pioneer Adam Back, view these developments as a vital push towards innovation in blockchain technologies, especially in layer-2 solutions. This sentiment is mirrored within the blockchain community, with enthusiasts and developers exploring new applications and capabilities of these platforms. The recent events in the blockchain sector underscore a pivotal evolution, with EVM inscriptions at the forefront. This movement highlights the escalating fascination with NFTs and digital collectibles and emphasizes the necessity for scalable and robust network solutions to cater to the increasing demand. As blockchain technology evolves, it paves the way for the next chapter of digital innovation and exploration.",
      "tags": [
        "#Blockchain",
        "#NFT market"
      ],
      "publishDate": "18/12/2023"
    },
    {
      "id": 47,
      "title": "Millions of Dollars in NFTs Stolen from Trader, Stolen Apes Returned After Bounty Payment",
      "absoluteURL": "https://www.todaynftnews.com/millions-of-dollars-in-nfts-stolen-from-trader-stolen-apes-returned-after-bounty-payment/",
      "fullContent": "SNEAK PEEK Hackers who infiltrated NFT Trader and stole valuable digital assets, including Bored Ape and Mutant Ape Yacht Club NFTs, were swiftly countered The incident demonstrated the strong unity and proactive approach within the NFT community. The breach exposed weaknesses in NFT trading platforms, leading to calls for enhanced security Hackers proactive approach within the NFT community In a striking turn of events, the NFT community witnessed a remarkable recovery of stolen digital assets. Recently, hackers infiltrated NFT Trader, a prominent peer-to-peer trading platform, pilfering a significant collection of nonfungible tokens (NFTs). Among the spoils were 37 Bored Ape Yacht Club (BAYC), 13 Mutant Ape Yacht Club (MAYC) tokens, and other valuable NFTs like VeeFriends and World of Women. Nearly $3 million theft left the digital art world in shock. Congratulations to the @BoringSecDAO in getting back those Apes. 🦍 Well done. ✅🎉🙌🏻 @BoredApeYC pic.twitter.com/brVGQ58Sg2 — realniceguy.eth ❄️🍌 (@realniceguy_SRH) December 17, 2023 However, the story took an unexpected twist. Boring Security, a Web3 security project, orchestrated a swift and effective response. They collaborated with Greg Solano, co-founder of Yuga Labs – the creator of BAYC and MAYC. Together, they strategised a resolution that involved a bounty payment. Their efforts bore fruit, and within 24 hours, all stolen NFTs were recovered. In exchange for the digital assets, the hackers received a 120 Ether (ETH) bounty, valued at approximately $267,000. This operation’s success hinged on the swift action and collaborative spirit within the NFT community. The gesture by Solano to finance the bounty and the proactive approach by Boring Security underscored resilience and unity in the face of adversity. It vividly demonstrated the community’s determination to uphold Security and integrity in the burgeoning NFT space. Meanwhile, the incident exposed vulnerabilities in NFT trading platforms, prompting urgent calls for enhanced security measures. Users were advised to revoke permissions granted to two specific old contracts, identified as potential gateways for similar attacks. This precaution was crucial in preventing further unauthorized NFT transfers. The NFT Trader team, aided by a developer known as Foobar, addressed the breach promptly. Their efforts highlighted the ongoing challenges and the need for continual vigilance in the dynamic world of digital asset trading. As the NFT market evolves, this incident serves as a stark reminder of the importance of robust security measures and the power of community collaboration in safeguarding valuable digital assets.",
      "tags": [
        "#BAYC",
        "#Hacking",
        "#MAYC",
        "#NFT Trader"
      ],
      "publishDate": "18/12/2023"
    },
    {
      "id": 48,
      "title": "Sotheby’s Auction of Bitcoin NFTs Surpasses Expectations, Fetches $450,000",
      "absoluteURL": "https://www.todaynftnews.com/sothebys-auction-of-bitcoin-nfts-surpasses-expectations-fetches-450000/",
      "fullContent": "SNEAK PEEK Sotheby’s recently hosted its inaugural auction of NFTs on the Bitcoin blockchain, marking a significant milestone in the worlds of art and cryptocurrency. The auction featured “BitcoinShrooms,” a collection of pixelated images, which collectively garnered an impressive $450,000, far exceeding initial estimates. A standout piece in the collection, resembling a character from the Super Mario series, was sold for an astonishing $240,000. In a historic moment for the world of art and cryptocurrency, Sotheby’s recently held its first-ever auction of NFTs on the Bitcoin blockchain, featuring a collection of pixelated images known as “BitcoinShrooms.” The results were nothing short of astonishing, as the three images on offer collectively garnered a staggering $450,000, surpassing estimates by a factor of five. The auction concluded on Wednesday and featured a trio of digital artworks, with one standout piece resembling a mushroom character from the iconic Super Mario franchise fetching an astounding $240,000. Another image, a pixelated avocado titled “BIP39 SEED,” originally expected to sell for $20,000 to $30,000, stunned observers by selling for $101,600. This auction was even more remarkable because over two-thirds of the bidders were new to the Sotheby’s platform, indicating a growing interest in NFTs on Bitcoin. This surge in popularity harkens back to the frenzy that engulfed digital-asset markets a couple of years ago when NFTs and digital artwork first started commanding eye-popping prices. Notably, one NFT by artist Beeple fetched an astonishing $69 million at Christie’s auction house. However, many of those NFT collections were built on the Ethereum blockchain, making Sotheby’s Bitcoin NFT auction a unique event. The “BitcoinShrooms” collection is credited to the pseudonymous artist Shroomtoshi and is part of the Ordinals inscriptions, a technology Casey Rodarmor developed atop the Bitcoin blockchain late last year. These inscriptions have gained popularity, causing congestion and increased fees on the Bitcoin network. The success of this auction raises an interesting debate within the Bitcoin community about whether to filter out transactions related to NFT-like inscriptions. Some argue that these inscriptions need to align with the original vision of Bitcoin as a peer-to-peer payment network. However, the perceived value of these digital images as high art could shift the balance in favour of profit interests. Sotheby’s groundbreaking auction of NFTs on the Bitcoin blockchain has demonstrated the mainstream appeal of these digital collectibles. With new bidders flocking to the platform and record-breaking sales, the intersection of art and cryptocurrency is evolving in exciting and unexpected ways.",
      "tags": [
        "#Bitcoin",
        "#Blockchain",
        "#NFT market"
      ],
      "publishDate": "16/12/2023"
    },
    {
      "id": 49,
      "title": "Polygon Joins Forces with The Sandbox for Lower Fee NFT Trading",
      "absoluteURL": "https://www.todaynftnews.com/polygon-joins-forces-with-the-sandbox-for-lower-fee-nft-trading/",
      "fullContent": "SNEAK PEEK The Sandbox has launched its NFT marketplace on the Polygon network, making it more accessible and cost-effective for users. Users can now mint digital assets using CATALYSTs on this new platform, democratizing the NFT creation process. The introduction of a secondary market allows for the resale of ASSETs, broadening trading and monetization opportunities. The Sandbox, a prominent player in the world of NFTs and virtual metaverse creation, has taken a significant stride towards enhancing accessibility and reducing costs for creators and users. The latest development sees the launch of The Sandbox Marketplace on Polygon, a move that promises to reshape the NFT landscape. One of the most notable features of this launch is the ability for anyone to mint their digital assets (ASSETs) on the Polygon marketplace using CATALYSTs. This democratizes the NFT creation process, making it accessible to a broader audience. Notably, Polygon’s network significantly reduces transaction fees, addressing a long-standing concern in the NFT space. Furthermore, The Sandbox introduces a secondary market, allowing NFT owners to resell ASSETs that they didn’t originally create on the platform. This opens up new avenues for trading and monetizing digital collectibles. For those already holding CATALYSTs, minting on the Polygon marketplace becomes readily accessible. But what if you don’t have CATALYSTs yet? The Sandbox plans to distribute CATALYSTs to ecosystem contributors, including LAND owners, as part of their commitment to expanding opportunities for creators. Existing ASSET holders need not worry about the fate of their assets. Minted assets on the Ethereum chain will remain usable and can be bridged to the Polygon layer in the future. Non-minted assets, like equipment, will be migrated to align with the new structure, ensuring a smooth transition for users. Gas fees have long been a concern for NFT enthusiasts, but The Sandbox addresses this by significantly reducing fees on the Polygon marketplace. Additionally, they cover a portion of Polygon transaction fees for users across their ecosystem, enhancing affordability. The user interface of the marketplace has undergone a revamp, with improved asset upload flows, asset moderation, and an enhanced user experience. This ensures a seamless and efficient trading experience for users. To buy your first NFT on Polygon via The Sandbox Marketplace, you need to log in, connect your wallet to the Polygon network, browse the marketplace, select your desired NFT, and complete the purchase. The process is streamlined, making it accessible to both newcomers and seasoned collectors. As The Sandbox expands its metaverse and NFT offerings, creators are encouraged to participate in VoxEdit contests and contribute to the vibrant community. The launch of the new marketplace also comes with a captivating collection from 30 talented artists, adding to the diversity of available ASSETs. The Sandbox’s move to launch its marketplace on Polygon opens up exciting opportunities for creators and collectors alike. With reduced fees, improved user experience, and a commitment to accessibility, it marks a significant step forward in the ever-evolving world of NFTs.",
      "tags": [
        "#NFT market",
        "#Polygon",
        "#The Sandbox"
      ],
      "publishDate": "15/12/2023"
    },
    {
      "id": 50,
      "title": "Casio Unveils Virtual G-Shock Watches as Ethereum NFTs with Exclusive Perks",
      "absoluteURL": "https://www.todaynftnews.com/casio-unveils-virtual-g-shock-watches-as-ethereum-nfts-with-exclusive-perks/",
      "fullContent": "SNEAK PEEK Casio, a Japanese electronics giant, ventures into the NFT space with a limited-edition collection of digital art featuring their iconic G-Shock brand. The NFT offering includes 2,000 art pieces showcasing futuristic “Virtual G-Shock” designs, priced at 0.1 ETH each. The company hints at potential collaborations with NFT holders for co-creating new digital Casio products. Japanese electronics giant Casio has made a bold move into the world of NFTs, offering a limited-edition collection of digital art collectibles featuring their iconic G-Shock brand of watches. This marks Casio’s second venture into the NFT space, following the successful debut of free G-Shock Creator Pass NFTs on the Ethereum scaling network Polygon back in September. The latest offering consists of 2,000 NFT art pieces, showcasing two futuristic and imaginative “Virtual G-Shock” designs. These designs push the boundaries of what’s possible with traditional physical materials and offer collectors a unique digital experience. Priced at 0.1 ETH each, roughly equivalent to $230 at the time of writing, the 1,000 editions of each Virtual G-Shock design promise more than just digital art. Owners of these Ethereum NFTs will enjoy a range of exclusive benefits, including behind-the-scenes access to Casio. They will have the opportunity to tour the G-Shock Endurance Test Laboratory in Tokyo, where they can witness the rigorous durability testing that has made the G-Shock brand legendary. Additionally, NFT collectors will participate in roundtable discussions with Casio’s designers, gaining insight into the creative process behind the virtual G-Shock models. They will also receive exclusive design materials associated with these digital watches and will be given the first right to purchase the next wave of Virtual G-Shock NFTs. Casio has even hinted at potential future collaborations with NFT holders to co-create new digital Casio products, demonstrating their commitment to digital and physical innovation. Oh Takahashi, Casio’s Senior General Manager of Timepieces, expressed the company’s dedication to deepening its engagement with the G-Shock community, stating, “These special incentives for collectors show our passion for innovation in both the digital and physical realms. We aim to deepen our engagement with the G-Shock community, bringing them into the heart of our innovation process.” With this move, Casio has joined the ranks of companies exploring the NFT space, offering enthusiasts not unique digital art but also exclusive experiences and opportunities, making it an exciting development for collectors and fans of the iconic G-Shock brand.",
      "tags": [
        "#Blockchain",
        "#Ethereum",
        "#NFT market"
      ],
      "publishDate": "15/12/2023"
    },
    {
      "id": 51,
      "title": "Web3 Chess Game Developer Discontinues Play-to-Earn Feature Amidst Rampant Cheating",
      "absoluteURL": "https://www.todaynftnews.com/web3-chess-game-developer-discontinues-play-to-earn-feature-amidst-rampant-cheating/",
      "fullContent": "SNEAK PEEK Immortal Game, a popular blockchain chess game, has announced the closure of its play-to-earn and NFT features. The decision was driven by widespread cheating, undermining the game’s integrity and player experience. This move has significantly impacted the play-to-earn gaming community and NFT market. Developers of the popular blockchain chess game Immortal Game have announced a significant decision that is sending shockwaves through the world of play-to-earn (P2E) gaming and nonfungible tokens (NFTs). In a surprising move, the creators have decided to shut down the P2E and NFT features of the Game due to a growing problem of rampant cheating. This move, announced on December 13, has left the gaming community in awe as Immortal Game was initially hailed as a pioneering platform aiming to provide players with a legitimate opportunity to earn income through chess. However, their noble intentions have backfired, leading to an influx of unfair practices and cheating within the Game. The root of the problem is the large sums of cash rewards offered with no entry barriers, which inadvertently encouraged players to exploit the system. In their announcement, immortal Game’s developers noted that this situation degraded the experience for genuine players who sought a fair and secure environment to enjoy online chess. Starting immediately, the marketplace for Immortal Game NFTs will be discontinued, and players will no longer be able to use the native P2E Checkmate token (CMT) within the Game. While NFTs will continue on the blockchain, users will no longer receive CMT rewards for participating in tournaments or daily challenges. Instead, fiat currency rewards may be introduced as an alternative. In a further adjustment, users will no longer see their ETH and CMT balances displayed on the platform, although these tokens will remain in their wallets. Those using custodial wallets must connect a personal wallet to facilitate asset transfers. Before its discontinuation, Immortal Game NFTs had amassed a lifetime trading volume of $885,600, while the CMT token boasted a fully diluted market capitalization of $360,075. These NFTs were minted on the Immutable blockchain, adding to the gaming landscape. This decision by Immortal Game’s developers marks a turning point in the P2E and NFT gaming industry, as it highlights the challenges and pitfalls associated with offering substantial financial incentives to players. It remains to be seen whether other projects in the space will follow suit or find innovative solutions to combat cheating while maintaining the allure of play-to-earn gaming.",
      "tags": [
        "#Blockchain",
        "#NFT market",
        "#Web3"
      ],
      "publishDate": "14/12/2023"
    },
    {
      "id": 52,
      "title": "NFT Division of Line Messenger Secures $140 Million Funding for Web3 Services",
      "absoluteURL": "https://www.todaynftnews.com/nft-division-of-line-messenger-secures-140-million-funding-for-web3-services/",
      "fullContent": "SNEAK PEEK Line Next, the NFT arm of Line, secures $140 million in funding for its global NFT marketplace, DOSI. Funding led by Crescendo Equity Partners, backed by Peter Thiel, showcases strong support for Line Next’s Web3 initiatives. DOSI integrates with Line’s existing Japan-based NFT marketplace, offering a comprehensive mobile app for worldwide NFT trading. Line Next, the NFT arm of the popular messaging app Line, has secured $140 million in funding as it gears up to launch a global NFT marketplace, DOSI, in January 2024. The funding round was led by Crescendo Equity Partners, a private equity firm backed by Peter Thiel. Line Next, dedicated to exploring Web3 initiatives, is poised to make waves in the NFT ecosystem with this substantial backing. DOSI, Line Next’s forthcoming global NFT marketplace, is set to integrate with Line’s existing Japan-based NFT marketplace, known as Line NFT. This integration will offer users an extensive and seamless NFT trading experience, all accessible through a mobile app that will be available worldwide. However, the ambitions of Line Next extend beyond just the NFT marketplace. Part of the $140 million fund will be allocated to the development of new Web3-focused services. Among these is a social app that enables users to interact with AI-generated characters, adding a unique twist to the social media landscape. Additionally, Web3 games will be part of Line Next’s repertoire, aiming to harness the power of blockchain technology for gaming enthusiasts. One notable aspect of Line’s NFT marketplace is its choice of blockchain technology. It will be built on the Finschia public blockchain, solidifying Line Next and Crescendo’s role as governance members of the Finschia Foundation. This strategic move positions Line Next to leverage the benefits of blockchain technology effectively. Shane Mac, co-founder of XMTP, emphasized the significance of Web3 messaging in a recent podcast, highlighting its potential to offer users greater control over their online interactions. Web3 messaging, he explained, represents a shift toward a new form of identity, where individuals have their wealth and personalities tied to wallet addresses. This innovative approach enhances security and trust in online communication. Line Next’s successful funding round and its upcoming NFT marketplace launch mark a significant development in the Web3 landscape. With a focus on AI-powered social apps and Web3 games, Line Next is poised to make waves in the NFT ecosystem and beyond. Utilizing blockchain technology further underscores the commitment to innovative solutions for the digital age.",
      "tags": [
        "#LINE App",
        "#NFT market",
        "#Web3"
      ],
      "publishDate": "13/12/2023"
    },
    {
      "id": 53,
      "title": "FIFA Set to Debut NFT Collection Ahead of 2023 Club World Cup",
      "absoluteURL": "https://www.todaynftnews.com/fifa-set-to-debut-nft-collection-ahead-of-2023-club-world-cup/",
      "fullContent": "SNEAK PEEK FIFA partners with Modex for its first NFT collection, set to launch on December 15. 100 exclusive NFTs offer a unique opportunity to secure tickets to the FIFA World Cup 2026 final. 900 digital collectibles on Polygon and OpenSea showcase memorable moments from the Club World Cup. FIFA, the international governing body for soccer, has announced its foray into the world of nonfungible tokens (NFTs), with an exclusive collection set to premiere just ahead of the 2023 Club World Cup in Saudi Arabia. In collaboration with blockchain firm Modex, FIFA’s inaugural NFT collection promises to offer fans an exciting opportunity. The collection, scheduled to launch on December 15, will consist of 100 NFTs, each of which grants the lucky owner a chance to secure tickets to the FIFA World Cup 2026 final—an enticing prospect for soccer enthusiasts worldwide. Additionally, 900 digital collectibles will be issued on the Polygon network and OpenSea this month. These NFTs will feature memorable moments from the tournament and digital renditions of coveted memorabilia. The FIFA Club World Cup, commencing on December 12 in Jeddah, Saudi Arabia, will bring together seven of the world’s finest football teams, including champions from FIFA’s six confederations. Fans eager to acquire these NFTs can do so via FIFA’s dedicated platform, FIFA+ Collect, launched in September 2022 and operates on the Algorand blockchain. Digital collectibles have rapidly gained popularity among sports enthusiasts, offering novel ways for fans to engage with their favorite players, teams, and the beautiful game. Francesco Abbate, CEO of Modex, expressed his enthusiasm, stating, “Digital collectibles increase how fans can interact with their favorite players, teams, and the game they love, and we’re honored to support FIFA in realizing this goal.” Since its inception, FIFA+ Collect has hosted 11 NFT drops, minting 909,255 digital collectibles held by 16,448 individuals. Notably, these NFTs have generated a trading volume of $2.4 million across primary and secondary NFT markets. FIFA+ Collect Info clarifies that the mint volume may include packs obtained through challenges rather than those purchased with USDC. This move by FIFA into the NFT space underscores the growing influence of blockchain technology in sports, offering fans unique opportunities to own digital pieces of soccer history while fostering a deeper connection with the sport they love. As the 2023 Club World Cup unfolds, the NFT world eagerly awaits the launch of this exclusive collection, setting a new precedent for the intersection of sports and blockchain technology.",
      "tags": [
        "#FIFA",
        "#NFT market"
      ],
      "publishDate": "13/12/2023"
    },
    {
      "id": 54,
      "title": "Former U.S. President Donald Trump Unveils NFT Collection with a ‘MugShot’ Theme",
      "absoluteURL": "https://www.todaynftnews.com/former-u-s-president-donald-trump-unveils-nft-collection-with-a-mugshot-theme/",
      "fullContent": "SNEAK PEEK Former President Trump announces his third NFT drop titled “MugShot,” depicting his historic arrest in 2023. Digital trading cards are available for $99; buyers of 47 or more cards can own Trump’s actual suit and dine with him at Mar-a-Lago. NFTs accessible through credit card or wETH, transferable on December 31, 2024; buyers must provide KYC information. Former U.S. President Donald Trump has announced his third nonfungible token (NFT) drop, titled “MugShot,” which revolves around his ongoing legal troubles. These unique digital trading cards are available for $99 each, with an intriguing incentive for buyers who acquire 47 or more cards: the chance to own a piece of President Trump’s actual suit from his infamous mugshot and enjoy dinner at Mar-a-Lago with the former president himself. What sets this NFT collection apart is its connection to a significant historical moment. On August 24, 2023, Donald Trump was formally arrested in Fulton County, Georgia, marking the first-ever mugshot of a United States President. In the arresting photo, Trump sports a furrowed brow and a determined gaze, symbolizing his unwavering spirit with the caption, “he’ll never surrender.” This NFT drop is accessible through credit card payments or Wrapped Ether (wETH), but there’s a catch. These digital assets will be transferable on December 31, 2024. Additionally, buyers must provide Know Your Customer (KYC) information, even if they opt to use cryptocurrency for their purchase. The “MugShot” NFT collection follows Trump’s two successful NFT launches. Notably, the former First Lady Melania Trump has also ventured into the NFT space with her collection. Trump decided to release this NFT collection as he seeks a non-consecutive second term in the 2024 U.S. presidential election. Currently facing 91 felony charges on allegations of business fraud and efforts to overturn the 2020 U.S. presidential election, it’s important to note that the U.S. Constitution does not automatically disqualify suspects or convicted individuals from running for federal office. Enforcing the 14th Amendment, which bars condemned insurrectionists from holding public office, would require congressional action. In the world of NFTs, where art and history intersect with digital innovation, President Trump’s “MugShot” drop adds another layer of intrigue and controversy, reflecting the ongoing narrative of his legal battles and political ambitions. This collection will draw attention and scrutiny as NFTs captivate the digital art world.",
      "tags": [
        "#Donald Trump NFT",
        "#NFT market"
      ],
      "publishDate": "13/12/2023"
    },
    {
      "id": 55,
      "title": "Yuga Labs Co-Founder Addresses Speculations About Their Return During Ongoing Health Hiatus",
      "absoluteURL": "https://www.todaynftnews.com/yuga-labs-co-founder-addresses-speculations-about-their-return-during-ongoing-health-hiatus/",
      "fullContent": "SNEAK PEEK Yuga Labs co-founder Wylie Aronow postpones return due to ongoing health recovery, prioritizing long-term well-being. Aronow, aka Gordon Goner, maintains a board role and strategic advisory position despite a congestive heart failure diagnosis. Despite health challenges, Aronow actively observes Yuga Labs’ operations, identifying key issues and suggesting changes. NFT entrepreneur Wylie Aronow, co-founder of Yuga Labs, has officially addressed rumors about his potential return to the NFT firm. Despite making steady progress in his health recovery, Aronow has firmly stated that he is not yet ready to return, emphasizing the importance of ensuring his long-term well-being. Aronow, who also goes by the name Gordon Goner, had taken a leave of absence from Yuga Labs in late January due to a congestive heart failure diagnosis. At that time, he clarified that he would continue to serve as a board member and strategic adviser to the company. In his recent statement, Aronow revealed the unpredictable nature of his health journey, describing days when he feels ready to dive back into work and others when he feels the need for immediate medical attention. While he has been away, Aronow has been watching Yuga Labs’ operations, responsible for popular NFT projects like Bored Ape Yacht Club (BAYC) and CryptoPunks. He has identified key issues hindering the company’s progress and has suggested necessary changes during board meetings. Despite his absence, Aronow expressed confidence in the current leadership of Yuga Labs, especially as the company faces a critical year in 2024. He believes the team is well-prepared to meet the challenges and impress the community. Before stepping back, Aronow acknowledged that he had pushed himself to the limits, working long hours nearly every day. He admitted that he should have heeded the advice of those around him and sought a better work-life balance. Yuga Labs has not stood still during Aronow’s absence, appointing Daniel Alegre, the former president and chief operating officer of Activision Blizzard, as its new CEO about a month before Aronow’s leave. In February 2021, Aronow co-founded Yuga Labs alongside Greg Solano, Zeshan Ali, and Kerem Atalay. The company’s portfolio includes notable NFTs such as CryptoPunks, BAYC, MeeBits, and Othersidemeta. Aronow’s commitment to his health and support to Yuga Labs from the sidelines highlight the resilience and determination of the entrepreneur and the NFT industry in navigating challenges and uncertainties.",
      "tags": [
        "#Blockchain",
        "#NFT market",
        "#Yuga Labs"
      ],
      "publishDate": "12/12/2023"
    },
    {
      "id": 56,
      "title": "South Korea Exempts NFTs and CBDCs from Cryptocurrency Interest Mandate",
      "absoluteURL": "https://www.todaynftnews.com/south-korea-exempts-nfts-and-cbdcs-from-cryptocurrency-interest-mandate/",
      "fullContent": "SNEAK PEEK Starting July 2024, South Korea’s FSC will enable investors to earn interest on digital asset deposits in exchanges. The directive excludes nonfungible tokens and central bank digital currencies from earning interest. Exchanges must segregate user deposits, entrust them to banks, and store 80% of coins in cold wallets. South Korea’s Financial Services Commission (FSC) has issued a new directive that will impact digital asset investors and exchanges in the country. According to the FSC’s notice, starting from July 2024, investors who deposit their digital assets into exchanges will be entitled to receive interest on their deposits. This move is part of South Korea’s efforts to regulate the crypto space more comprehensively. However, there are exceptions to this new rule. Nonfungible tokens (NFTs) and central bank digital currencies (CBDCs) have been excluded from the mandate. The FSC’s decision to exclude NFTs and CBDCs reflects the unique nature of these digital assets, which may not fit the criteria for interest-bearing deposits. Interestingly, the FSC has left room for potential exceptions to this exclusion. If certain NFTs are categorized as payment methods and are issued in significant quantities, they may be reclassified as virtual assets and become eligible for interest when deposited into exchanges. This shows the regulator’s flexibility in adapting to the evolving landscape of digital assets. In addition to addressing interest on deposits, the FSC has also laid out guidelines for the safe handling of user deposits by virtual asset operators. Exchanges are now required to segregate user deposits from their own assets and entrust them to a bank. Furthermore, a substantial portion, specifically 80%, of the coins must be stored in a secure cold wallet, enhancing security measures. The FSC’s directive also covers preparations for potential hacks or computer incidents. Virtual asset service providers are mandated to either acquire insurance or accumulate reserves to mitigate the impact of such incidents. Additionally, the new law prohibits exchanges from blocking deposits or withdrawals unless it is deemed absolutely necessary and authorized by the courts or financial regulators. South Korea has been actively solidifying its regulatory framework for the cryptocurrency industry. Earlier in December, financial regulators called on users to report unlicensed crypto exchanges operating within the country. This initiative was led by the Digital Asset Exchange Association and the Financial Intelligence Unit of South Korea. As South Korea continues to adapt to the ever-evolving landscape of digital assets, these regulatory changes aim to strike a balance between investor protection and industry growth. The FSC’s decision to exclude NFTs and CBDCs, while allowing for potential exceptions, highlights the need for flexible and nuanced regulation in the world of cryptocurrencies.",
      "tags": [
        "#NFT market",
        "#South Korea"
      ],
      "publishDate": "11/12/2023"
    },
    {
      "id": 57,
      "title": "NFT Trading Surges Close to $1 Billion as Bullish Momentum Grips Crypto Markets",
      "absoluteURL": "https://www.todaynftnews.com/nft-trading-surges-close-to-1-billion-as-bullish-momentum-grips-crypto-markets/",
      "fullContent": "SNEAK PEEK The trading volume of Non-Fungible Tokens (NFTs) is approaching a significant milestone, nearing $1 billion in total value. A substantial 125% increase in NFT trading activity occurred in November. The average transaction value of NFTs has significantly risen, indicating a growing market interest and value. In a compelling turn of events, the nonfungible token (NFT) market has experienced a robust surge in trading volume, approaching the $1 billion mark in November. DappRadar, a decentralized app tracking platform, released data revealing that NFT trading has embraced the bullish wave, marking the second consecutive month of upward momentum. The report from DappRadar indicates a remarkable 125% increase in NFT trading volume in November, signaling a significant shift in user behavior compared to previous downtrends in NFT activity. Notably, this surge comes amid a broader positive trend in the cryptocurrency markets. Executives within the Web3 space are optimistic about the continuation of this trend. Jonathan Perkins, the co-founder of SuperRare, conveyed to Cointelegraph on November 14 that the worst of the bear market appears to be behind us, suggesting a favorable outlook for the NFT sector in the coming months. In addition to the surge in trading volume, the average value of NFT transactions experienced an impressive 114% increase, climbing from $126 to $270 throughout November. This indicates a growing confidence and willingness among participants to engage in higher-value transactions within the NFT space. DappRadar’s report also sheds light on the increased daily unique active wallets (UAW) in blockchain gaming, witnessing a 14% rise. The decentralized applications industry saw blockchain gaming with a 34% market dominance, reinforcing its status as a fundamental pillar in the decentralized ecosystem. Despite a seemingly bearish mood throughout the year, blockchain gaming projects have managed to secure a substantial $2.3 billion in investments from the beginning of 2023 up to October. This resilience is particularly evident in the third quarter of 2023, where blockchain gaming secured an impressive $600 million in investments, even amidst lower cryptocurrency market prices than previous peaks. In conclusion, the NFT market’s remarkable resurgence and the resilience of blockchain gaming investments paint a picture of a dynamic and evolving landscape within the cryptocurrency space. As the crypto markets turn bullish, these trends may signal a broader shift in user sentiment and behavior, marking a positive outlook for the industry in the months ahead.",
      "tags": [
        "#Blockchain",
        "#NFT market"
      ],
      "publishDate": "11/12/2023"
    },
    {
      "id": 58,
      "title": "Animoca Brands Secures Additional $11.88 Million for Mocaverse in Second Funding Tranche",
      "absoluteURL": "https://www.todaynftnews.com/animoca-brands-secures-additional-11-88-million-for-mocaverse-in-second-funding-tranche/",
      "fullContent": "SNEAK PEEK Animoca Brands Corporation Limited successfully raised $11.88 million in a second funding tranche for Mocaverse. Key participants in this funding round included Block1, OKX Ventures, Foresight Ventures, Polygon Ventures, Dapper Labs, among others. The funding was achieved by issuing new ordinary shares priced at A$4.50 each, and investors received free-attaching utility token warrants on a 1:1 dollar basis. Animoca Brands Corporation Limited has announced the successful completion of a second funding tranche for Mocaverse, raising $11.88 million. This comes after an initial investment of $20 million in September 2023. We are pleased to announce that we have raised an additional US$11.88 million for @MocaverseNFT to build the digital identity and point system for #Web3 #gaming, culture, and entertainment.🎉 Full details: https://t.co/g4GXNp1NEB pic.twitter.com/yCt5wfmPET — Animoca Brands (@animocabrands) December 8, 2023 Prominent participants in this funding round included Block1, OKX Ventures, Foresight Ventures, Polygon Ventures, Dapper Labs, and others. The funding was raised by issuing new ordinary shares at a price per share of A$4.50. Notably, investors in each round were granted free-attaching utility token warrants on a 1:1 dollar basis. Mocaverse is focused on establishing itself as the empowerment layer for Web3 culture and entertainment. It aims to facilitate seamless onboarding and sustained growth for Web3 projects through its loyalty system, the Web3 Frequent Player Program, powered by Mocaverse loyalty points known as “Realm Points.” Mocaverse is set to serve as an interoperable meta-experience layer for Web3 identity, social interactions, and growth. Users can create their digital identity, build a reputation, and earn and spend Realm Points within the Mocaverse ecosystem. This ecosystem is supported by Animoca Brands’ extensive portfolio of over 400 companies and a partner network with more than 700 million addressable users. The recently introduced Moca ID will play a pivotal role as a digital passport, allowing users to earn Realm Points through engagement within the Mocaverse ecosystem. These points can then be redeemed for exclusive real-life benefits and rewards offered by Mocaverse and Animoca Brands. The Web3 Frequent Player Program is envisioned as a permissionless and interoperable loyalty system, with plans for progressive decentralization to enable third-party adoption and integration of Moca ID. This approach aims to enhance accessibility and foster growth within the broader Web3 ecosystem. Animoca Brands is raising funds through Simple Agreements for Future Equity (SAFEs) with sophisticated investors, totaling $11.88 million at a share price of A$4.50. The SAFEs will automatically convert to ordinary shares after six months, with the number of new shares determined by the AUD: USD exchange rate at settlement. Currently, Animoca Brands has 1,910,074,127 outstanding fully paid ordinary shares. This additional funding for Mocaverse marks a significant step in advancing the vision of Web3 culture and entertainment empowerment. Mocaverse’s innovative approach and the support from prominent investors underscore its potential to reshape the Web3 landscape.",
      "tags": [
        "#Animoca Brands",
        "#OKX Exchange",
        "#Web3"
      ],
      "publishDate": "08/12/2023"
    },
    {
      "id": 59,
      "title": "Reebok Enters the Realm of Digital Fashion and Gaming, Enhanced by AI, Following Nike’s Lead",
      "absoluteURL": "https://www.todaynftnews.com/reebok-enters-the-realm-of-digital-fashion-and-gaming-enhanced-by-ai-following-nikes-lead/",
      "fullContent": "SNEAK PEEK Reebok, a sportswear brand owned by Adidas, is entering the digital fashion and gaming sphere by partnering with crypto tech startup Futureverse. This collaboration is focused on integrating AI and blockchain technologies into Reebok’s products, reminiscent of Nike’s earlier ventures in digital fashion. The partnership aims to bring Reebok’s styles into the digital world as wearable NFTs and to create immersive virtual gaming experiences. Reebok, a prominent sportswear brand, is making significant strides into digital fashion and gaming, reminiscent of Nike’s earlier ventures. Owned by Adidas, Reebok has formed a unique partnership with the crypto tech startup Futureverse, marking a significant step towards integrating AI and blockchain technologies into their products. Thrilled to announce our exclusive partnership with @Reebok to leverage our AI and metaverse technology to revolutionize digital fashion. Together, we introduce @ReebokImpact. Coming 2024. pic.twitter.com/30Qk02aujk — Futureverse (@futureverse) December 7, 2023 This collaboration aims to revolutionize digital fashion and extend Reebok’s brand into virtual spaces. The plan includes the development of AI-enhanced and blockchain-supported games and digital experiences. This initiative brings Reebok’s styles into the digital world as wearable NFTs and emphasizes creating immersive virtual gaming experiences. A critical project in this partnership is “Reebok Impact,” which is slated for launch next year. This initiative is described as a “mind and heart-bending digital shoe experience” that integrates AI technology with on-chain digital wearables. The goal is to illustrate that life’s essence is not just about the sneakers one wears but about one’s experiences while wearing them. Reebok CEO Todd Krinsky highlighted the importance of participating in the world purposefully, and this partnership with Futureverse is seen as a step towards redefining the limits of innovation and consumer engagement in the digital evolution of products. Futureverse, which secured $54 million in Series A funding in July, aims to create an “open metaverse” where digital assets like NFTs can move freely across multiple platforms. The company is expanding its ecosystem by acquiring other crypto firms, games, and metaverse experiences, although this collaboration with Reebok marks its first foray into digital footwear. In comparison, Nike acquired RTFKT, an NFT sneaker studio, in December 2021, leading the footwear industry into the virtual domain. Since then, Nike has built a robust NFT community and released exclusive physical sneaker collections with digital counterparts. Following this trend, brands like Adidas, Dior, and Puma have launched similar “phygital” products. While Reebok has not announced any plans for physical sneakers linked to digital tokens yet, it has revealed a limited-edition sneaker drop in collaboration with Gary Vaynerchuk’s NFT brand VeeFriends. This special edition will initially be available to VeeFriends token holders before being released globally. Reebok’s partnership with Futureverse represents a significant move into the digital realm, blending AI and blockchain technology to create unique gaming and digital fashion experiences, potentially reshaping how consumers interact with the brand in virtual spaces.",
      "tags": [
        "#Blockchain",
        "#NFT market"
      ],
      "publishDate": "08/12/2023"
    },
    {
      "id": 60,
      "title": "Megadeth Leaps into NFT Realm with Exclusive Fan Experiences",
      "absoluteURL": "https://www.todaynftnews.com/megadeth-leaps-into-nft-realm-with-exclusive-fan-experiences/",
      "fullContent": "SNEAK PEEK Megadeth’s NFTs redefine music fan engagement, bridging real and virtual realms for a groundbreaking experience. Exclusive content and one-on-one interactions make Megadeth’s NFTs more than collectibles, enhancing fan connections. The heavy metal genre’s embrace of NFTs, exemplified by Avenged Sevenfold, signals a growing trend in the music industry. Thrash metal pioneer Megadeth has made a significant entry into the world of NFTs. On December 5, they announced a unique collection that merges digital and physical realms. This initiative marks a new era for fan interaction in the music industry. The band, fronted by Dave Mustaine, has millions of loyal followers. Their excitement is palpable, signaling a significant shift in how fans engage with music icons. The collection, named MegadethDigital, features 5,000 generative pieces. It stars Vic Rattlehead, the band’s digital mascot, in a fresh artistic vision. The initiative, set to go live on December 22, transcends typical fan club boundaries. Hence, it promises a community-owned experience, blending the real and the virtual worlds. Introducing @MegadethDigital. Our 5000-piece generative collection featuring Vic Rattlehead brought to life in a new way by our talented artist @TheHaddy. Live on December 22nd, you'll have the opportunity to unlock doors in the real and metaverse world alike, gaining access to… pic.twitter.com/Ed9YxqCTe6 — Megadeth (@Megadeth) December 5, 2023 Moreover, these NFTs are not mere collectibles. They serve as keys to exclusive content and experiences. Holders can access special merchandise and VIP events. Additionally, they offer chances for one-on-one interactions with band members. This approach adds a tangible, personal touch to digital assets. Megadeth’s foray into NFTs mirrors a growing trend in the heavy metal genre. Notably, Avenged Sevenfold’s Deathbats Club has also embraced Web3 technology. They pioneered NFT ticketing for their concerts, receiving a warm welcome from fans. Consequently, this movement signifies a broader acceptance of NFTs in the music industry. Shoutout to @DeathbatsClub for leading the way in NFT utility and a seamless purchasing of tickets. I know a lot of happy fans out there right now who are glad they bought in! #A7X3rdLeg #A7X #DBC 💀🦇🔥 pic.twitter.com/wYDemKrMTW — Nate (@BestBagleinTown) November 29, 2023 Significantly, Megadeth’s move is more than a nod to current trends. It is a strategic embrace of technology for deeper fan engagement. Their NFTs act as a bridge, connecting the virtual and physical fan experiences. This innovative approach could set a new standard for artist-fan interactions. However, the initiative’s success hinges on the fans’ reception and participation. Early responses suggest a positive outlook. Fans are eager to explore this new dimension of their favorite band. The combination of heavy metal and NFTs is a winning formula. Megadeth’s NFT venture reflects the evolving landscape of music and technology. It not only offers exclusive experiences but also empowers fans. As this trend grows, it could revolutionize how artists and fans connect. MegadethDigital is not just a collection; it’s a pioneering step into a future where music, art, and technology converge seamlessly.",
      "tags": [
        "#NFT market"
      ],
      "publishDate": "07/12/2023"
    },
    {
      "id": 61,
      "title": "Ethereum NFT Developers Rush to Safeguard Projects Against Thirdweb Security Flaw",
      "absoluteURL": "https://www.todaynftnews.com/ethereum-nft-developers-rush-to-safeguard-projects-against-thirdweb-security-flaw/",
      "fullContent": "SNEAK PEEK Thirdweb, a provider of crypto development tools, has disclosed a significant vulnerability in their smart contracts, impacting the Ethereum NFT community. The issue affects pre-built contracts from Thirdweb, particularly concerning Ethereum’s ERC-721, ERC-1155, and ERC-20 standards. OpenZeppelin, another smart contract library, confirmed that the vulnerability does not originate from their code but is helping to address the issue. In the dynamic world of Ethereum NFTs, a recent revelation about a vulnerability in Thirdweb’s smart contracts has sent ripples through the community. Thirdweb, known for its crypto development tools, disclosed a significant issue in a widely used open-source library for Web3 smart contracts. This discovery has prompted a swift response from Ethereum NFT marketplaces and creators, underscoring the urgency of securing digital assets. The vulnerability, which remains undisclosed to prevent exploitation, affects pre-built contracts provided by Thirdweb and potentially others. Smart contracts are the backbone of decentralized apps and NFT collections, making this a critical concern for stakeholders. OpenZeppelin, another prominent player in smart contract libraries, clarified that the problem does not originate from its repository. Despite this, the company has committed to leading the community in identifying affected parties and offering mitigation strategies. IMPORTANT On November 20th, 2023 6pm PST, we became aware of a security vulnerability in a commonly used open-source library in the web3 industry. This impacts a variety of smart contracts across the web3 ecosystem, including some of thirdweb’s pre-built smart contracts.… — thirdweb (@thirdweb) December 5, 2023 In a proactive measure, Thirdweb advises projects to lock down their current smart contracts and transition to new ones, ensuring the safety of their collections. The firm has also pledged to support affected parties financially by covering the network fees for this migration. This recommendation comes after Thirdweb implemented a fix to its smart contract templates on November 22, ensuring that contracts deployed after this date are secure. The exploit impacts NFT smart contracts adhering to Ethereum’s ERC-721 and ERC-1155 standards and ERC-20 standard fungible tokens. Thirdweb’s blog post provides a detailed list of affected contract types and a tool for identifying compromised contracts. Several major industry players have weighed in on the situation. OpenSea and Rarible, leading NFT marketplaces, are exploring ways to assist collection owners with contract migrations. Coinbase revealed that some collections on its NFT platform are affected, while Manifold, a smart contract startup, confirmed its contracts are safe. Base, an Ethereum layer-2 network, acknowledged the impact on some project contracts but assured the network’s security. Ethereum profile picture project Cool Cats and Animoca Brands’ Mocaverse gaming platform are moving to new contracts to safeguard their NFT collections. In response to the challenge, Thirdweb has doubled its bug bounty payments to $50,000 and committed to a more stringent auditing process in the future. This incident highlights the ongoing challenges in the rapidly evolving field of NFTs and the importance of robust security measures to protect digital assets in the decentralized space.",
      "tags": [
        "#Ethereum",
        "#NFT market"
      ],
      "publishDate": "06/12/2023"
    },
    {
      "id": 62,
      "title": "Tiger Global & Coatue Management Cut NFT Investments Amid Market Volatility",
      "absoluteURL": "https://www.todaynftnews.com/tiger-global-coatue-management-cut-nft-investments-amid-market-volatility/",
      "fullContent": "SNEAK PEEK Tiger Global’s NFT portfolio slashes reflect crypto market caution amid volatility. Coatue Management marks down OpenSea investment by 90%, echoing NFT market reevaluation. The evolving NFT space prompts major investors to recalibrate, shaping crypto’s future stability. In a significant move, Tiger Global, a prominent investment firm, has drastically reduced its investments in notable non-fungible token (NFT) projects. These investments include the Bored Ape Yacht Club (BAYC) collection and the NFT marketplace OpenSea. Bloomberg’s recent report reveals that Tiger Global slashed its BAYC stakes by 69% and OpenSea holdings by 94%. Moreover, the firm has also cut valuations for several other portfolio companies. Tiger Global’s decision reflects a cautious approach towards the volatile crypto market. The firm has been diversifying its investments in the crypto realm, focusing on NFTs and blockchain security and privacy-focused initiatives. In 2021, it co-led a $24 million funding round for blockchain security company CertiK, emphasizing its commitment to enhancing decentralized finance (DeFi) security. Furthermore, in 2022, Tiger Global participated in a Series B investment for Aleo, a zero-knowledge applications platform, which successfully raised $200 million. This round saw leading investors like Kora Management LP and SoftBank Vision Fund 2. Additionally, the firm invested in Polygon, a layer-2 network, showcasing its broad interest in crypto. However, Tiger Global is not alone in this cautious stance. Coatue Management, another major player and co-lead investor in OpenSea, recently marked down its investment in the NFT marketplace by 90%. This reduction brought OpenSea’s valuation down to $1.4 billion, a significant decrease from its previous valuation. These markdowns by Tiger Global and Coatue Management signal a broader trend of reevaluation within the NFT market. Investors are becoming more circumspect, primarily due to fluctuating market values. Consequently, this shift could lead to more conservative investment strategies in the NFT and broader crypto sectors. Besides these adjustments, these investment giants’ moves underscore the NFT space’s evolving nature. Hence, as the market matures, further recalibrations in investments are likely. These developments may pave the way for more stable and sustainable growth in the crypto and NFT sectors in the long run.",
      "tags": [
        "#NFT market"
      ],
      "publishDate": "02/12/2023"
    }
]
